{
  "arquivo": "Altereções-necessárias.pdf",
  "caminho_original": "C:\\Users\\FELIPE BITENCOURT\\.gemini\\antigravity\\scratch\\Artigo-Brain_devices\\Altereções-necessárias.pdf",
  "data_extracao": "2026-01-11T20:22:16.402414",
  "total_paginas": 14,
  "metadados": {
    "format": "PDF 1.4",
    "title": "Cópia de rev_DecisionLetter+Instruções",
    "author": "",
    "subject": "",
    "keywords": "",
    "creator": "",
    "producer": "Skia/PDF m145 Google Docs Renderer",
    "creationDate": "",
    "modDate": "",
    "trapped": "",
    "encryption": null
  },
  "paginas": [
    {
      "numero": 1,
      "texto": "Decision Letter  -   Reviewers' Comments to Authors \nIEEE Access - Initial Submission - Decision on Manuscript ID Access-2025-49739 \n \nReviewer 1 \nR1C0. \nSTATUS - Encarregado \nThe manuscript presents a review of portable EEG and fNIRS brain monitoring devices, offering an \nimpressive collection of technical specifications, market availability, and bibliometric adoption. The \nmanuscript would benefit from a more in-depth analytical synthesis, clearer methodological justifications \nfor some metrics, and a stronger link between device characteristics and the requirements dictated by \napplications in neuroscience and neurorehabilitation. The authors should address these limitations to \nimprove the scientific rigour, interpretability, and translational relevance of the review. \n \n1. Reduzir a quantidade de texto descritivo (listas de dispositivos). \n2. Investir mais em acrescentar comparações e interpretações entre dispositivos. \n3. Justificar claramente por que cada métrica foi usada. \n4. Relacionar características técnicas dos dispositivos em relação: \n●​\nao uso em pesquisa em neurociência; \n●​\nao uso em neuroreabilitação clínica. \n5. Tornar os resultados mais úteis para tomada de decisão. \n→ Onde: Introduction, Results, Discussion​  \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C1. \nSTATUS - Felipe e Eduarda  \nHow do the authors justify the use of the “number of DOI-indexed publications” as a proxy for device \nadoption without normalising device age, year of market entry, or industry-specific publishing practices? \n \n1. Explicar no Methods que essa métrica indica uso na literatura, não qualidade. \n2. Substituir termos ambíguos por “inclusion rate” ou “proxy de adoção”. \n3. Normalizar a métrica pelo tempo: \n●​\ncalcular o número de artigos por ano desde o lançamento do dispositivo. \n4. Criar 1 tabela ou figura comparando: \n●​\nnúmero total de artigos; \n●​\nnúmero de artigos por ano. \n5. Acrescentar um parágrafo explicando a limitação dessa métrica. \n→ Onde: Methods, Results, Figures, Tables, Limitations \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C2.  \nSTATUS - Encarregado",
      "caracteres": 2097
    },
    {
      "numero": 2,
      "texto": "Given the absence of critical evaluation, how should readers interpret differences in signal quality, \nreliability, or suitability for clinical versus experimental use among devices with similar specifications? \n \n1. Escrever um parágrafo explicando que especificações técnicas semelhantes não garantem \ndesempenho igual. \n2. Agrupar os dispositivos em categorias de uso: \n●​\npesquisa experimental; \n●​\nuso clínico/translacional; \n●​\nuso exploratório/educacional. \n3. Criar uma tabela indicando: \n●​\ntipo de uso recomendado por categoria; \n●​\nexistência ou não de validação independente. \n4. Orientar o leitor sobre como interpretar os dados apresentados. \n→ Onde: Results, Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C3.  \nSTATUS - Encarregado \nHow do the authors address the potential bias introduced by manufacturer-provided specifications, \nparticularly for parameters such as sampling rate, resolution, and wireless performance? \n \n1. Identificar nas tabelas quais dados vêm de: \n●​\nfabricantes; \n●​\nartigos científicos. \n2. Marcar claramente quando o dado é apenas declarado pelo fabricante. \n3. Acrescentar no texto que: \n●​\nesses dados não substituem testes independentes; \n●​\nservem apenas para comparação técnica básica. \n4. Criar um parágrafo em Limitations sobre esse viés. \n→ Onde: Methods, Tables, Limitations \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C4.  \nRESOLVIDO - claudio \nCould the authors clarify how latency, jitter, and throughput, which are discussed conceptually in the \ncontext, could be quantitatively integrated into the comparative framework to support real-time or \nclosed-loop applications? \n \n1. Explicar de forma simples: 1. O que é latência; 2. Por que ela é importante para BCI e \nneurofeedback. \n2. Classificar os dispositivos em: 1. Adequados para tempo real; 2. Potencialmente adequados; 3. \nNão adequados. \n3. Criar uma tabela com essa classificação. \n4. Relacionar explicitamente com aplicações em loop fechado.",
      "caracteres": 1961
    },
    {
      "numero": 3,
      "texto": "→ Onde: Results, Discussion \n \nRESPONSE TO REVIEWERS \nWe thank the reviewer for this important comment. As device-specific numerical values for latency, jitter, \nand wireless throughput are rarely disclosed and are highly configuration-dependent, they could not be \ndirectly compared across devices. Instead, these parameters were quantitatively integrated into the \ncomparative framework using protocol- and data-rate–based proxies. Throughput was inferred from \nchannel count and nominal sampling rate, while latency and jitter were contextualized according to the \nwireless communication protocol. \n \nThis proxy-based operationalization was incorporated into Table 1 through the addition of a “Closed-loop \nreadiness (proxy-based)” column, classifying devices as Low, Medium, or High in terms of suitability for \nreal-time \nand \nclosed-loop \napplications. \nThis \napproach \nenables \na \nsystematic comparison of \ntransmission-related performance trade-offs and reflects timing and bandwidth constraints relevant to \nclosed-loop applications, such as real-time neurofeedback, adaptive BCI control, and event-locked \nmultimodal synchronization, without implying regulatory certification or guaranteed real-time \nperformance. \n \n \n \nR1C5.  \nSTATUS - Encarregado \nIn its current form, the review emphasises hardware characteristics. How do the authors plan to integrate \ncomputational modelling or signal processing performance metrics to go beyond descriptive comparison? \n \n1. Criar uma subseção chamada “Signal Processing and Computational Considerations” \n2. Explicar que o desempenho depende de hardware + software. \n3. Citar exemplos da literatura onde os dispositivos foram usados com: \n●​\nmachine learning; \n●​\nBCI; \n●​\nneurofeedback. \n4. Deixar claro que o artigo discute compatibilidade, não testa algoritmos. \n→ Onde: Discussion (nova subseção) \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C6.  \nSTATUS - Encarregado \nThe manuscript highlights multimodal integration (EEG, fNIRS, IMU, ECG, etc.). How do the authors propose \nto evaluate the effectiveness of sensor fusion rather than simply the availability of sensors? \n \n1. Diferenciar claramente: \n●​\nter vários sensores; \n●​\nintegrar bem esses sensores. \n2. Criar níveis simples de multimodalidade: \n●​\nNível 1: sensores disponíveis; \n●​\nNível 2: sincronização descrita; \n●​\nNível 3: fusão usada em estudos. \n3. Atualizar tabelas e texto para refletir esses níveis.",
      "caracteres": 2425
    },
    {
      "numero": 4,
      "texto": "→ Onde: Results, Tables​\n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nAdditional Questions Reviewer 1 \nR1AQ1.  \nSTATUS - Encarregado \nDoes the paper contribute to the body of knowledge? The manuscript provides a systematic, \nmarket-orientated review of portable and wireless devices for EEG and fNIRS brain monitoring currently \navailable worldwide. The collection of 96 devices and the quantification of their adoption in research \nthrough DOI-indexed publications represent an original and valuable resource for neuroscientists, \nbiomedical engineers, and clinicians. The work offers an evidence-based mapping of the commercial \nlandscape of neurotechnologies, thereby filling a recognised gap between engineering specifications and \npractical research implementation. \n \n1. Deixar explícito no Abstract e na Introduction qual é a contribuição original do artigo. \n2. Acrescentar um parágrafo dizendo claramente que o artigo: \n●​\nreúne 96 dispositivos comerciais; \n●​\nconecta especificações técnicas com uso real em pesquisa; \n●​\npreenche a lacuna entre engenharia e aplicação prática. \n3. Reforçar que o número de artigos DOI-indexados é usado como indicador de uso na literatura, \nnão de qualidade do dispositivo. \n4. Incluir uma frase de síntese na Discussion explicando por que esse mapeamento é útil para \npesquisadores e clínicos. \n→ Onde: Abstract, Introduction, Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \nR1AQ2. \nRESOLVIDO - claudio   \nIs the paper technically sound? The methodology follows PRISMA-ScR guidelines, is transparently \nregistered in the OSF, and utilises several high-quality databases. Technical descriptions of EEG and fNIRS \nsystems are generally accurate and detailed. However, the review does not critically evaluate signal quality, \nvalidation protocols, or performance trade-offs between different devices, which limits the interpretability \nof technical comparisons. Furthermore, latency, jitter, wireless throughput, and multimodal synchronisation \nare discussed descriptively but are not operationalised consistently within the comparative framework. \n \n1. Manter a descrição metodológica (PRISMA-ScR e OSF), pois está correta. \n2. Acrescentar um parágrafo explicando que o foco do artigo é comparação técnica e de adoção, não \nvalidação clínica. \n3. Criar uma subseção em Limitations abordando: ausência de testes diretos de qualidade de sinal; \ndependência de dados fornecidos por fabricantes. \n4. Tornar explícito que latência, jitter e sincronização são discutidos como critérios aplicacionais, \nnão como medições experimentais. \n5. Ajustar o texto para evitar interpretações de que os autores testaram os dispositivos. \n→ Onde: Methods, Discussion, Limitations",
      "caracteres": 2699
    },
    {
      "numero": 5,
      "texto": "RESPONSE TO REVIEWERS \nWe thank the reviewer for this constructive comment. This scoping review focuses on device-level technical \nspecifications, reported capabilities, and patterns of use across the literature, rather than on experimental \nvalidation of signal quality or controlled performance benchmarking. Validation protocols, signal-to-noise \nratios, and quantitative performance metrics are highly task-, setup-, and population-dependent and are \ninconsistently reported across studies, making a cross-device experimental comparison of signal quality \nbeyond the scope of this review. \n \nTo ensure interpretability despite these constraints, performance trade-offs were addressed at an \narchitectural and applicational level, considering consistently reported characteristics such as channel \ncount, electrode technology, wireless communication protocol, data access, and software integration. \n \nRegarding latency, jitter, wireless throughput, and multimodal synchronization, these parameters are now \nexplicitly treated as application-level performance criteria rather than experimental measurements. As \ndevice-specific \nnumerical \nvalues \nare \nrarely \ndisclosed \nby \nmanufacturers \nand \nare \nhighly \nconfiguration-dependent, they were operationalized within the comparative framework using protocol- and \ndata-rate–based proxies. Throughput requirements were inferred from channel count and nominal sampling \nrate, while latency and jitter were contextualized according to the wireless communication protocol. \n \nThese criteria were integrated into Table 1 through the addition of a “Closed-loop readiness (proxy-based)” \ncolumn, enabling a systematic and consistent comparison of device suitability for real-time and closed-loop \napplications, without implying regulatory certification or guaranteed real-time performance. \n \n \n \nR1AQ3.  \nSTATUS - Encarregado \nIs the subject matter presented in a comprehensive manner? The manuscript presents terms on device \ncoverage, market breadth, and technical descriptors. However, the presentation lacks comparative analyses, \ndecision matrices, or performance-based groupings, which reduces the practical usability of the results \nsection. \n \n1. Reduzir trechos apenas descritivos na seção de Resultados. \n2. Criar pelo menos uma tabela ou figura comparativa, por exemplo: \n●​\ndispositivos por tipo de aplicação (pesquisa, clínica, BCI); \n●​\ndispositivos por nível de multimodalidade; \n●​\ndispositivos por adequação a tempo real. \n3. Inserir agrupamentos claros (classes ou categorias) no texto. \n4. Acrescentar uma interpretação prática após cada tabela: \n●​\no que o leitor deve concluir a partir dela. \n5. Tornar a seção Results mais orientada à tomada de decisão. \n→ Onde: Results, Tables, Figures \n \nRESPONSE TO REVIEWERS \nText…",
      "caracteres": 2796
    },
    {
      "numero": 6,
      "texto": "Reviewer 2 \nR2C0. \nSTATUS - Encarregado \nThe manuscript appears to address a research topic in brain–computer interfaces, neurophysiology, and \nmulti-modal biosignal analysis, as evidenced by extensive references to EEG, EMG, fNIRS, cognitive \nworkload datasets, and deep learning-based signal processing. A comprehensive catalog and technical \nmapping of 96 brain-monitoring devices (125 if variants included), using PRISMA methodology and OSF \nregistration. This topic is highly relevant and aligns well with the scope of the IEEE Access Journal. However, \nsome concerns regarding your manuscript need to be addressed as follows: \n \n1. Manter o escopo geral do artigo (catálogo + mapeamento técnico). \n2. Tornar explícito que o foco é mapeamento técnico e adoção, não validação clínica direta. \n3. Reforçar no texto que o artigo é um scoping review orientado à tomada de decisão, não um \nbenchmark experimental. \n→ Onde: Introduction, Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C1. \nSTATUS - Felipe e Eduarda   \nThe Introduction effectively contextualizes EEG/fNIRS relevance, but the research problem is not tightly \nframed. The text implies lack of standardization and difficulty selecting devices but does not explicitly state \nthe research question nor hypothesis. \n \n1. Inserir no final da Introduction: \n●​\numa pergunta de pesquisa explícita, por exemplo: \n●​\n“How can commercially available portable EEG/fNIRS devices be systematically compared \nto support informed selection for neuroscience and neurorehabilitation research?” \n2. Acrescentar uma frase explicando por que escolher dispositivos é um problema real. \n3. Deixar claro que o artigo não testa hipóteses, mas responde a uma questão de mapeamento e \ncomparação. \n→ Onde: Introduction \n \nRESPONSE TO REVIEWERS \nText… \n \nR2C2. \nSTATUS - Eduardo  \nIt would be advisable to include explicit search syntax for each database, a screening flow diagram with \nreasons for exclusion, and a statement addressing risk-of-bias and data verification limitations \n \n1. Criar uma subseção em Methods com strings de busca completas para cada base (copiar do \nprotocolo OSF). \n2. Incluir um fluxograma PRISMA com números de exclusão por motivo (duplicata, falso positivo, \netc.). \n3. Acrescentar um parágrafo chamado “Risk of bias and data verification” explicando:",
      "caracteres": 2327
    },
    {
      "numero": 7,
      "texto": "●​\nuso de dados de fabricantes; \n●​\nausência de verificação independente. \n→ Onde: Methods, Figures \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C3.  \nSTATUS - Encarregado \nThe literature review presents a broad range of references, including EEG and cognitive-fatigue datasets \nand IoT neurotechnology applications. However, the discussion remains largely descriptive rather than \nanalytical. It lacks a comparison matrix or critical synthesis that clearly connects gaps in prior work to the \ncurrent research. Additionally, key state-of-the-art contributions are missing, such as recent developments \nin EEG Transformers, neural ODE-based models (2024–2025), biosignal foundation models (e.g., BMCL-23), \nand advances in federated learning for bio-signal processing. \n \n1. Criar uma subseção nova em Discussion: “Relation to recent advances in biosignal processing” \n●​\nInserir referências (sem aprofundar demais) sobre: \n●​\nEEG Transformers; \n●​\nmodelos fundacionais de biossinais; \n●​\naprendizado federado em EEG. \n●​\nExplicar claramente: \n○​\npor que esses avanços não foram o foco do artigo; \n○​\ncomo eles dependem da escolha do hardware. \n→ Onde: Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C4. \nRESOLVIDO - claudio   \nThe current contribution is ambiguous. The manuscript does not articulate what is new beyond other \npublished surveys (e.g., wireless EEG surveys, multimodal neurotech reviews). \n \n1. O que exatamente este artigo faz que outros surveys não fazem? \n2. Em que dimensão ele é diferente (escopo, método, dados, resultado)? \n3. Por que ele não é “apenas mais um survey de EEG wireless / multimodal”? \n→ Onde: Introduction, Conclusion \n \nRESPONSE TO REVIEWERS \nWe thank the reviewer for this important comment. To clarify the novelty of the contribution, we revised the \nIntroduction to explicitly contrast this work with existing wireless EEG and multimodal neurotechnology \nsurveys. While prior reviews typically focus on signal processing methods, experimental paradigms, or \nlimited subsets of devices, the present study provides a large-scale, device-level mapping of commercially \navailable EEG and fNIRS systems. The revised text highlights the unique integration of technical \nspecifications, \napplication-oriented \ncriteria \n(including \nproxy-based \nclosed-loop \nreadiness \nand",
      "caracteres": 2311
    },
    {
      "numero": 8,
      "texto": "synchronization support), and bibliometric indicators of device adoption, thereby clarifying the distinct \ncontribution of this review. \n \n \n \nR2C5. \nPRODUZINDO - claudio  \nImprove visual clarity of figures (resolution, captions, axis labels) \n \n1. Revisar todas as figuras: \n●​\naumentar resolução; \n●​\nmelhorar legendas; \n●​\nnomear eixos claramente. \n2. Garantir que cada figura possa ser entendida sem ler o texto. \n→ Onde: Figures \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C6. \nSTATUS - Felipe e Eduarda   \nAdd a “Limitations & Future Work” section. \n \n1. Criar seção própria: “Limitations and Future Work” \n2. Listar limitações claras: \n●​\nausência de benchmark; \n●​\ndependência de dados de fabricantes; \n●​\nnão avaliação clínica direta. \n3. Listar caminhos futuros: \n●​\nbenchmarking experimental; \n●​\nintegração com IA; \n●​\nestudos clínicos. \n→ Onde: Final do manuscrito \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C7.  \nSTATUS - Encarregado \nThe abstract does not faithfully mirror scope and objectives. It lists general concepts with no quantifiable \nachievements. \n \n1. Reescrever o Abstract para conter: \n●​\nnúmero de dispositivos; \n●​\nmétodo (PRISMA-ScR); \n●​\nprincipal resultado (mapeamento + adoção). \n2. Evitar termos genéricos.",
      "caracteres": 1239
    },
    {
      "numero": 9,
      "texto": "3. Usar números sempre que possível. \n→ Onde: Abstract \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C8.  \nSTATUS - Encarregado \nThe article lists devices but does not benchmark them technically. \n \n1. Criar benchmark indireto, baseado em: \n●​\ncategorias (baixa/média/alta densidade); \n●​\nadequação a tempo real; \n●​\naplicações típicas. \n2. Deixar explícito que: \n●​\nnão é benchmarking experimental. \n→ Onde: Results e Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C9.  \nSTATUS - Encarregado \nIt may be beneficial to include a section titled “Clinical, Industrial, and Societal Deployment Pathways,” \nwhere potential deployment scenarios and their constraints are discussed. \n \n1. Criar uma nova seção com esse título: “Clinical, Industrial, and Societal Deployment Pathways” \n2. Discutir brevemente: \n●​\nuso clínico; \n●​\nbarreiras hospitalares; \n●​\ncusto e regulamentação. \n3. Relacionar dispositivos a cenários reais. \n→ Onde: Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nAdditional Questions \nR2AQ1.  \nSTATUS - Encarregado \nDoes the paper contribute to the body of knowledge? The manuscript contributes a valuable \nmarket-mapping dataset of 96 wireless EEG and fNIRS devices (125 including variants), compiled via a \nPRISMA-ScR protocol and OSF registration. This large-scale technical catalog is useful for researchers \nmaking device-selection decisions. However, its scientific advancement is limited, because the paper is",
      "caracteres": 1435
    },
    {
      "numero": 10,
      "texto": "primarily descriptive and does not provide critical synthesis, benchmarking, or analytical interpretation of \ndevice performance, clinical applicability, or research validation. \n \n1. Transformar o texto atual em uma resposta afirmativa clara. \n2. Reconhecer o caráter descritivo. \n3. Explicar por que o mapeamento ainda é uma contribuição científica válida. \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2AQ2.  \nSTATUS - Encarregado \nIs the paper technically sound? Partially, with methodological gaps that weaken its rigor. There is no \nbenchmarking, device validation, or SNR/latency/impedance comparative analysis, lack of reproducibility \ninformation (reviewer count, exclusion rules, search strings), reliance on self-reported manufacturer data \nwithout verification. \n \n1. Reconhecer limitações metodológicas explicitamente. \n2. Justificar escolhas metodológicas. \n3. Evitar qualquer afirmação de validação técnica direta. \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2AQ3.  \nSTATUS - Encarregado \nIs the subject matter presented in a comprehensive manner? The manuscript thoroughly lists devices, \nspecifications, bibliometric usage, and general technological considerations. However, several major \ndomains expected in a “comprehensive review” are missing or insufficiently developed, such as, no inclusion \nof 2023–2025 state-of-the-art advances (e.g., EEG-transformers, multimodal AI, federated EEG learning, \nbiosignal foundation models), limited discussion of translational pathways (clinical use, hospital deployment \nbarriers, regulatory context, cost-effectiveness), no roadmap or identification of future research gaps. \n \n1. Inserir referências 2023–2025 estratégicas. \n2. Criar um roadmap futuro. \n3. Relacionar tecnologia, clínica e sociedade. \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nReviewer 3 \nR3C1. \nPARCIALMENTE RESOLVIDO - claudio",
      "caracteres": 1846
    },
    {
      "numero": 11,
      "texto": "The abstract states: \"2,087 studies explicitly reported the use of brain devices... resulting in a true positive \nrate of 55.79%.\" The term \"true positive rate\" is typically used in classification/diagnostic contexts \n(sensitivity = TP/(TP+FN)). In a literature search, this terminology is confusing. What constitutes a \"false \nnegative\" in your search strategy? Are you referring to the precision of your search query (relevant papers / \ntotal retrieved papers)? Please clarify this metric. If you mean that 55.79% of the screened papers were \nrelevant (i.e., actually used brain devices), use standard systematic review terminology such as \"inclusion \nrate\" or \"relevance rate.\" Provide a PRISMA flow diagram showing the exact numbers at each screening \nstage. \n \n1. Substituir completamente o termo true positive rate por “inclusion rate” em todo o artigo. \n2. Inserir na seção Methods uma definição formal: \n●​\nInclusion rate = (nº de estudos que realmente usaram o dispositivo) / (nº total de registros \nrecuperados). \n3. Deixar claro que: \n●​\nnão há “false negatives”; \n●​\ntrata-se de eficiência da estratégia de busca, não métrica diagnóstica. \n4. Garantir que o fluxograma PRISMA mostre: \n●​\nregistros recuperados; \n●​\nexcluídos por falso positivo (nome ambíguo, menção sem uso); \n●​\nincluídos finais. \n→ Onde: Abstract, Methods, Results, PRISMA Figure \n \nResponse To Reviewers \nWe agree with the reviewer that the term true positive rate is inappropriate in the context of a \nliterature search. The manuscript has been revised to replace this term with inclusion rate, which \nis consistent with systematic review terminology. The inclusion rate is now explicitly defined in the \nMethods section as the proportion of retrieved records that explicitly applied the named brain \ndevice as an experimental or clinical tool, reflecting the precision of the device-specific search \nqueries, rather than sensitivity or recall. The Abstract and Results sections were updated \naccordingly to report that 2,087 of 3,741 unique records met the inclusion criteria, yielding an \noverall inclusion rate of 55.79%. A PRISMA flow diagram has also been added to report the \nnumber of records retrieved, duplicates removed, records screened, and studies included at each \nstage. \n \n \n​\nR3C2. \nSTATUS - claudio   \nThe manuscript states that 96 devices were \"tracked in the market\" but does not describe the market survey \nmethodology. How were the 96 devices identified? Was there a systematic search of manufacturer websites, \nregulatory databases (e.g., FDA, CE marking), or commercial catalogs? Were devices from China, India, or \nother non-Western markets included? Requirement: Add a dedicated subsection in the Methods describing \nthe device identification protocol. Include: 1. Search terms used (e.g., \"wireless EEG,\" \"portable fNIRS\"); 2. \nDatabases/sources consulted (e.g., Google Scholar, manufacturer websites, ResearchGate equipment lists); \n3. Inclusion/exclusion criteria (e.g., \"commercially available as of August 2025,\" \"wireless only\"); 4. A \nsupplementary table listing all 96 devices with manufacturer, model number, and year of market entry. \n \n1. Criar uma subseção nova em Methods chamada: “Device identification and market survey \nprotocol” \n2. Descrever claramente:",
      "caracteres": 3282
    },
    {
      "numero": 12,
      "texto": "●​\ntermos de busca usados (ex.: “wireless EEG”, “portable fNIRS”); \n●​\nfontes consultadas: \n○​\nsites de fabricantes; \n○​\nGoogle Scholar; \n○​\ncatálogos comerciais; \n○​\nliteratura científica. \n3. Especificar critérios de inclusão: \n●​\ndispositivo comercialmente disponível; \n●​\nportátil e/ou wireless; \n●​\nEEG e/ou fNIRS; \n●​\ndisponível até mês/ano definido. \n4. Especificar critérios de exclusão: \n●​\nprotótipos acadêmicos; \n●​\ndispositivos descontinuados; \n●​\nsoftwares sem hardware. \n5. Confirmar explicitamente: \n●​\ninclusão de dispositivos de mercados não ocidentais (China, Índia). \n6. Criar uma tabela suplementar com: \n●​\nfabricante; \n●​\nmodelo; \n●​\nano de entrada no mercado. \n→ Onde: Methods + Supplementary Material \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR3C3. \nSTATUS - claudio   \nThe manuscript reports percentages (e.g., Epoc X = 19.30%, OpenBCI = 4.81%) but lacks deeper statistical \nanalysis. These percentages suggest a highly skewed distribution (a few devices dominate, while most have \nminimal adoption). This is a classic \"long-tail\" phenomenon. Requirement: 1. Provide a Lorenz curve or Gini \ncoefficient to quantify the inequality in research adoption; 2. Perform a correlation analysis: 2.1. Does \ndevice cost negatively correlate with adoption rate? 2.2. Does channel count positively correlate with \ncitation frequency? 2.3. Use regression analysis to identify which technical specifications (e.g., open API, dry \nelectrodes, price) predict research adoption. \n \n1. Gerar uma Curva de Lorenz para adoção dos dispositivos. \n2. Calcular o coeficiente de Gini da distribuição de citações. \n3. Fazer análises simples: \n●​\ncorrelação entre preço vs adoção; \n●​\ncorrelação entre nº de canais vs adoção. \n4. Rodar uma regressão exploratória com variáveis como: \n●​\nopen API (sim/não); \n●​\ntipo de eletrodo (seco/molhado); \n●​\npreço aproximado. \n5. Deixar explícito que a análise é exploratória, não causal. \n→ Onde: Results + Figures + Methods (estatística) \n \nRESPONSE TO REVIEWERS \nText…",
      "caracteres": 2008
    },
    {
      "numero": 13,
      "texto": "R3C4.  \nPARCIALMENTE RESOLVIDO - claudio \nThe abstract mentions \"a significant gap between consumer-grade and research-grade technologies\" but \ndoes not define these categories. Is the classification based on price, signal quality (SNR), regulatory \napproval (FDA Class II), or intended use? Requirement: 1. Provide explicit criteria for this classification. For \nexample: 1.1. Consumer-grade: < $500, < 8 channels, dry electrodes, primarily marketed for \nmeditation/gaming; 1.2. Research-grade: > $5,000, > 32 channels, wet/gel electrodes, medical-grade \ncertification. \n \n1. Criar critérios explícitos em Methods ou Results: \n2. Aplicar essa classificação de forma consistente. \n3. Ajustar o Abstract para refletir essa definição. \n4. Inserir na tabela a classificação “Grade: consumer / research / clinical” \n→ Onde: Methods, Results, Abstract \n \nRESPONSE TO REVIEWERS \nWe have added an explicit definitional paragraph clarifying that the classification of EEG devices is based on \nintended use, technical specifications, signal quality, and regulatory status. This paragraph was placed \nbefore the detailed technical comparison to improve conceptual clarity and directly address the reviewer’s \nconcern. This classification framework is supported by prior studies distinguishing consumer-grade, \nresearch-grade, and clinical-grade EEG systems based on these criteria (Chuang and Lin, 2019; Doudou et \nal., 2020; Huang et al., 2020; Grasso-Cladera et al., 2023). \n \n \n​\nR3C5. \nSTATUS - Encarregado \nThe manuscript mentions devices \"currently available\" but does not analyze temporal evolution. The \nneurotechnology market has evolved rapidly. Early devices (e.g., NeuroSky MindWave, 2009) differ \nsignificantly from recent models (e.g., Kernel Flow, 2023). Requirement: 1. Add a timeline figure showing \nwhen each device entered the market; 2. Analyze trends: 2.1. Has the average channel count increased over \ntime? 2.2. Has the price per channel decreased (Moore's Law for neurotechnology)? 2.3. When did wireless \narchitectures become dominant? \n \n1. Criar uma linha do tempo mostrando ano de entrada de cada dispositivo no mercado. \n2. Analisar tendências simples: \n●​\naumento do nº médio de canais ao longo do tempo; \n●​\nredução do custo por canal; \n●​\ntransição para arquiteturas wireless. \n3. Relacionar essas tendências à evolução tecnológica geral. \n→ Onde: Results, Figures, Discussion \n \nRESPONSE TO REVIEWERS \nText…",
      "caracteres": 2444
    },
    {
      "numero": 14,
      "texto": "R3C6.  \nSTATUS - Encarregado \nThe manuscript states \"125 models and variants\" but does not explain how variants were handled in the \nanalysis. If a study used \"Epoc\" (2009) and another used \"Epoc X\" (2018), were these counted separately or \naggregated? The Epoc X has significant hardware improvements (5-electrode reference system, improved \nwireless). Clarify the aggregation strategy. If variants were pooled, justify this decision. If kept separate, \nprovide a breakdown showing which specific variant was most cited. \n \n1. Explicar claramente a estratégia adotada: \n●​\nvariantes agrupadas por família ou \n●​\nvariantes tratadas separadamente. \n2. Justificar a decisão: \n●​\nsemelhança técnica; \n●​\ncontinuidade comercial. \n3. Se variantes foram separadas, apresentar qual versão foi mais citada. \n4. Incluir essa explicação em Methods. \n→ Onde: Methods, Supplementary Table \n \nRESPONSE TO REVIEWERS \nText… \n \n \nFINAL STATEMENT \nWe believe that the revised manuscript has substantially improved in clarity, analytical depth, \nmethodological transparency, and translational relevance. We sincerely thank the reviewers and \nthe Associate Editor for their valuable feedback and hope that the revised version meets the \nstandards of IEEE Access.",
      "caracteres": 1245
    }
  ],
  "texto_completo": "Decision Letter  -   Reviewers' Comments to Authors \nIEEE Access - Initial Submission - Decision on Manuscript ID Access-2025-49739 \n \nReviewer 1 \nR1C0. \nSTATUS - Encarregado \nThe manuscript presents a review of portable EEG and fNIRS brain monitoring devices, offering an \nimpressive collection of technical specifications, market availability, and bibliometric adoption. The \nmanuscript would benefit from a more in-depth analytical synthesis, clearer methodological justifications \nfor some metrics, and a stronger link between device characteristics and the requirements dictated by \napplications in neuroscience and neurorehabilitation. The authors should address these limitations to \nimprove the scientific rigour, interpretability, and translational relevance of the review. \n \n1. Reduzir a quantidade de texto descritivo (listas de dispositivos). \n2. Investir mais em acrescentar comparações e interpretações entre dispositivos. \n3. Justificar claramente por que cada métrica foi usada. \n4. Relacionar características técnicas dos dispositivos em relação: \n●​\nao uso em pesquisa em neurociência; \n●​\nao uso em neuroreabilitação clínica. \n5. Tornar os resultados mais úteis para tomada de decisão. \n→ Onde: Introduction, Results, Discussion​  \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C1. \nSTATUS - Felipe e Eduarda  \nHow do the authors justify the use of the “number of DOI-indexed publications” as a proxy for device \nadoption without normalising device age, year of market entry, or industry-specific publishing practices? \n \n1. Explicar no Methods que essa métrica indica uso na literatura, não qualidade. \n2. Substituir termos ambíguos por “inclusion rate” ou “proxy de adoção”. \n3. Normalizar a métrica pelo tempo: \n●​\ncalcular o número de artigos por ano desde o lançamento do dispositivo. \n4. Criar 1 tabela ou figura comparando: \n●​\nnúmero total de artigos; \n●​\nnúmero de artigos por ano. \n5. Acrescentar um parágrafo explicando a limitação dessa métrica. \n→ Onde: Methods, Results, Figures, Tables, Limitations \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C2.  \nSTATUS - Encarregado\n\nGiven the absence of critical evaluation, how should readers interpret differences in signal quality, \nreliability, or suitability for clinical versus experimental use among devices with similar specifications? \n \n1. Escrever um parágrafo explicando que especificações técnicas semelhantes não garantem \ndesempenho igual. \n2. Agrupar os dispositivos em categorias de uso: \n●​\npesquisa experimental; \n●​\nuso clínico/translacional; \n●​\nuso exploratório/educacional. \n3. Criar uma tabela indicando: \n●​\ntipo de uso recomendado por categoria; \n●​\nexistência ou não de validação independente. \n4. Orientar o leitor sobre como interpretar os dados apresentados. \n→ Onde: Results, Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C3.  \nSTATUS - Encarregado \nHow do the authors address the potential bias introduced by manufacturer-provided specifications, \nparticularly for parameters such as sampling rate, resolution, and wireless performance? \n \n1. Identificar nas tabelas quais dados vêm de: \n●​\nfabricantes; \n●​\nartigos científicos. \n2. Marcar claramente quando o dado é apenas declarado pelo fabricante. \n3. Acrescentar no texto que: \n●​\nesses dados não substituem testes independentes; \n●​\nservem apenas para comparação técnica básica. \n4. Criar um parágrafo em Limitations sobre esse viés. \n→ Onde: Methods, Tables, Limitations \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C4.  \nRESOLVIDO - claudio \nCould the authors clarify how latency, jitter, and throughput, which are discussed conceptually in the \ncontext, could be quantitatively integrated into the comparative framework to support real-time or \nclosed-loop applications? \n \n1. Explicar de forma simples: 1. O que é latência; 2. Por que ela é importante para BCI e \nneurofeedback. \n2. Classificar os dispositivos em: 1. Adequados para tempo real; 2. Potencialmente adequados; 3. \nNão adequados. \n3. Criar uma tabela com essa classificação. \n4. Relacionar explicitamente com aplicações em loop fechado.\n\n→ Onde: Results, Discussion \n \nRESPONSE TO REVIEWERS \nWe thank the reviewer for this important comment. As device-specific numerical values for latency, jitter, \nand wireless throughput are rarely disclosed and are highly configuration-dependent, they could not be \ndirectly compared across devices. Instead, these parameters were quantitatively integrated into the \ncomparative framework using protocol- and data-rate–based proxies. Throughput was inferred from \nchannel count and nominal sampling rate, while latency and jitter were contextualized according to the \nwireless communication protocol. \n \nThis proxy-based operationalization was incorporated into Table 1 through the addition of a “Closed-loop \nreadiness (proxy-based)” column, classifying devices as Low, Medium, or High in terms of suitability for \nreal-time \nand \nclosed-loop \napplications. \nThis \napproach \nenables \na \nsystematic comparison of \ntransmission-related performance trade-offs and reflects timing and bandwidth constraints relevant to \nclosed-loop applications, such as real-time neurofeedback, adaptive BCI control, and event-locked \nmultimodal synchronization, without implying regulatory certification or guaranteed real-time \nperformance. \n \n \n \nR1C5.  \nSTATUS - Encarregado \nIn its current form, the review emphasises hardware characteristics. How do the authors plan to integrate \ncomputational modelling or signal processing performance metrics to go beyond descriptive comparison? \n \n1. Criar uma subseção chamada “Signal Processing and Computational Considerations” \n2. Explicar que o desempenho depende de hardware + software. \n3. Citar exemplos da literatura onde os dispositivos foram usados com: \n●​\nmachine learning; \n●​\nBCI; \n●​\nneurofeedback. \n4. Deixar claro que o artigo discute compatibilidade, não testa algoritmos. \n→ Onde: Discussion (nova subseção) \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR1C6.  \nSTATUS - Encarregado \nThe manuscript highlights multimodal integration (EEG, fNIRS, IMU, ECG, etc.). How do the authors propose \nto evaluate the effectiveness of sensor fusion rather than simply the availability of sensors? \n \n1. Diferenciar claramente: \n●​\nter vários sensores; \n●​\nintegrar bem esses sensores. \n2. Criar níveis simples de multimodalidade: \n●​\nNível 1: sensores disponíveis; \n●​\nNível 2: sincronização descrita; \n●​\nNível 3: fusão usada em estudos. \n3. Atualizar tabelas e texto para refletir esses níveis.\n\n→ Onde: Results, Tables​\n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nAdditional Questions Reviewer 1 \nR1AQ1.  \nSTATUS - Encarregado \nDoes the paper contribute to the body of knowledge? The manuscript provides a systematic, \nmarket-orientated review of portable and wireless devices for EEG and fNIRS brain monitoring currently \navailable worldwide. The collection of 96 devices and the quantification of their adoption in research \nthrough DOI-indexed publications represent an original and valuable resource for neuroscientists, \nbiomedical engineers, and clinicians. The work offers an evidence-based mapping of the commercial \nlandscape of neurotechnologies, thereby filling a recognised gap between engineering specifications and \npractical research implementation. \n \n1. Deixar explícito no Abstract e na Introduction qual é a contribuição original do artigo. \n2. Acrescentar um parágrafo dizendo claramente que o artigo: \n●​\nreúne 96 dispositivos comerciais; \n●​\nconecta especificações técnicas com uso real em pesquisa; \n●​\npreenche a lacuna entre engenharia e aplicação prática. \n3. Reforçar que o número de artigos DOI-indexados é usado como indicador de uso na literatura, \nnão de qualidade do dispositivo. \n4. Incluir uma frase de síntese na Discussion explicando por que esse mapeamento é útil para \npesquisadores e clínicos. \n→ Onde: Abstract, Introduction, Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \nR1AQ2. \nRESOLVIDO - claudio   \nIs the paper technically sound? The methodology follows PRISMA-ScR guidelines, is transparently \nregistered in the OSF, and utilises several high-quality databases. Technical descriptions of EEG and fNIRS \nsystems are generally accurate and detailed. However, the review does not critically evaluate signal quality, \nvalidation protocols, or performance trade-offs between different devices, which limits the interpretability \nof technical comparisons. Furthermore, latency, jitter, wireless throughput, and multimodal synchronisation \nare discussed descriptively but are not operationalised consistently within the comparative framework. \n \n1. Manter a descrição metodológica (PRISMA-ScR e OSF), pois está correta. \n2. Acrescentar um parágrafo explicando que o foco do artigo é comparação técnica e de adoção, não \nvalidação clínica. \n3. Criar uma subseção em Limitations abordando: ausência de testes diretos de qualidade de sinal; \ndependência de dados fornecidos por fabricantes. \n4. Tornar explícito que latência, jitter e sincronização são discutidos como critérios aplicacionais, \nnão como medições experimentais. \n5. Ajustar o texto para evitar interpretações de que os autores testaram os dispositivos. \n→ Onde: Methods, Discussion, Limitations\n\nRESPONSE TO REVIEWERS \nWe thank the reviewer for this constructive comment. This scoping review focuses on device-level technical \nspecifications, reported capabilities, and patterns of use across the literature, rather than on experimental \nvalidation of signal quality or controlled performance benchmarking. Validation protocols, signal-to-noise \nratios, and quantitative performance metrics are highly task-, setup-, and population-dependent and are \ninconsistently reported across studies, making a cross-device experimental comparison of signal quality \nbeyond the scope of this review. \n \nTo ensure interpretability despite these constraints, performance trade-offs were addressed at an \narchitectural and applicational level, considering consistently reported characteristics such as channel \ncount, electrode technology, wireless communication protocol, data access, and software integration. \n \nRegarding latency, jitter, wireless throughput, and multimodal synchronization, these parameters are now \nexplicitly treated as application-level performance criteria rather than experimental measurements. As \ndevice-specific \nnumerical \nvalues \nare \nrarely \ndisclosed \nby \nmanufacturers \nand \nare \nhighly \nconfiguration-dependent, they were operationalized within the comparative framework using protocol- and \ndata-rate–based proxies. Throughput requirements were inferred from channel count and nominal sampling \nrate, while latency and jitter were contextualized according to the wireless communication protocol. \n \nThese criteria were integrated into Table 1 through the addition of a “Closed-loop readiness (proxy-based)” \ncolumn, enabling a systematic and consistent comparison of device suitability for real-time and closed-loop \napplications, without implying regulatory certification or guaranteed real-time performance. \n \n \n \nR1AQ3.  \nSTATUS - Encarregado \nIs the subject matter presented in a comprehensive manner? The manuscript presents terms on device \ncoverage, market breadth, and technical descriptors. However, the presentation lacks comparative analyses, \ndecision matrices, or performance-based groupings, which reduces the practical usability of the results \nsection. \n \n1. Reduzir trechos apenas descritivos na seção de Resultados. \n2. Criar pelo menos uma tabela ou figura comparativa, por exemplo: \n●​\ndispositivos por tipo de aplicação (pesquisa, clínica, BCI); \n●​\ndispositivos por nível de multimodalidade; \n●​\ndispositivos por adequação a tempo real. \n3. Inserir agrupamentos claros (classes ou categorias) no texto. \n4. Acrescentar uma interpretação prática após cada tabela: \n●​\no que o leitor deve concluir a partir dela. \n5. Tornar a seção Results mais orientada à tomada de decisão. \n→ Onde: Results, Tables, Figures \n \nRESPONSE TO REVIEWERS \nText…\n\nReviewer 2 \nR2C0. \nSTATUS - Encarregado \nThe manuscript appears to address a research topic in brain–computer interfaces, neurophysiology, and \nmulti-modal biosignal analysis, as evidenced by extensive references to EEG, EMG, fNIRS, cognitive \nworkload datasets, and deep learning-based signal processing. A comprehensive catalog and technical \nmapping of 96 brain-monitoring devices (125 if variants included), using PRISMA methodology and OSF \nregistration. This topic is highly relevant and aligns well with the scope of the IEEE Access Journal. However, \nsome concerns regarding your manuscript need to be addressed as follows: \n \n1. Manter o escopo geral do artigo (catálogo + mapeamento técnico). \n2. Tornar explícito que o foco é mapeamento técnico e adoção, não validação clínica direta. \n3. Reforçar no texto que o artigo é um scoping review orientado à tomada de decisão, não um \nbenchmark experimental. \n→ Onde: Introduction, Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C1. \nSTATUS - Felipe e Eduarda   \nThe Introduction effectively contextualizes EEG/fNIRS relevance, but the research problem is not tightly \nframed. The text implies lack of standardization and difficulty selecting devices but does not explicitly state \nthe research question nor hypothesis. \n \n1. Inserir no final da Introduction: \n●​\numa pergunta de pesquisa explícita, por exemplo: \n●​\n“How can commercially available portable EEG/fNIRS devices be systematically compared \nto support informed selection for neuroscience and neurorehabilitation research?” \n2. Acrescentar uma frase explicando por que escolher dispositivos é um problema real. \n3. Deixar claro que o artigo não testa hipóteses, mas responde a uma questão de mapeamento e \ncomparação. \n→ Onde: Introduction \n \nRESPONSE TO REVIEWERS \nText… \n \nR2C2. \nSTATUS - Eduardo  \nIt would be advisable to include explicit search syntax for each database, a screening flow diagram with \nreasons for exclusion, and a statement addressing risk-of-bias and data verification limitations \n \n1. Criar uma subseção em Methods com strings de busca completas para cada base (copiar do \nprotocolo OSF). \n2. Incluir um fluxograma PRISMA com números de exclusão por motivo (duplicata, falso positivo, \netc.). \n3. Acrescentar um parágrafo chamado “Risk of bias and data verification” explicando:\n\n●​\nuso de dados de fabricantes; \n●​\nausência de verificação independente. \n→ Onde: Methods, Figures \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C3.  \nSTATUS - Encarregado \nThe literature review presents a broad range of references, including EEG and cognitive-fatigue datasets \nand IoT neurotechnology applications. However, the discussion remains largely descriptive rather than \nanalytical. It lacks a comparison matrix or critical synthesis that clearly connects gaps in prior work to the \ncurrent research. Additionally, key state-of-the-art contributions are missing, such as recent developments \nin EEG Transformers, neural ODE-based models (2024–2025), biosignal foundation models (e.g., BMCL-23), \nand advances in federated learning for bio-signal processing. \n \n1. Criar uma subseção nova em Discussion: “Relation to recent advances in biosignal processing” \n●​\nInserir referências (sem aprofundar demais) sobre: \n●​\nEEG Transformers; \n●​\nmodelos fundacionais de biossinais; \n●​\naprendizado federado em EEG. \n●​\nExplicar claramente: \n○​\npor que esses avanços não foram o foco do artigo; \n○​\ncomo eles dependem da escolha do hardware. \n→ Onde: Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C4. \nRESOLVIDO - claudio   \nThe current contribution is ambiguous. The manuscript does not articulate what is new beyond other \npublished surveys (e.g., wireless EEG surveys, multimodal neurotech reviews). \n \n1. O que exatamente este artigo faz que outros surveys não fazem? \n2. Em que dimensão ele é diferente (escopo, método, dados, resultado)? \n3. Por que ele não é “apenas mais um survey de EEG wireless / multimodal”? \n→ Onde: Introduction, Conclusion \n \nRESPONSE TO REVIEWERS \nWe thank the reviewer for this important comment. To clarify the novelty of the contribution, we revised the \nIntroduction to explicitly contrast this work with existing wireless EEG and multimodal neurotechnology \nsurveys. While prior reviews typically focus on signal processing methods, experimental paradigms, or \nlimited subsets of devices, the present study provides a large-scale, device-level mapping of commercially \navailable EEG and fNIRS systems. The revised text highlights the unique integration of technical \nspecifications, \napplication-oriented \ncriteria \n(including \nproxy-based \nclosed-loop \nreadiness \nand\n\nsynchronization support), and bibliometric indicators of device adoption, thereby clarifying the distinct \ncontribution of this review. \n \n \n \nR2C5. \nPRODUZINDO - claudio  \nImprove visual clarity of figures (resolution, captions, axis labels) \n \n1. Revisar todas as figuras: \n●​\naumentar resolução; \n●​\nmelhorar legendas; \n●​\nnomear eixos claramente. \n2. Garantir que cada figura possa ser entendida sem ler o texto. \n→ Onde: Figures \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C6. \nSTATUS - Felipe e Eduarda   \nAdd a “Limitations & Future Work” section. \n \n1. Criar seção própria: “Limitations and Future Work” \n2. Listar limitações claras: \n●​\nausência de benchmark; \n●​\ndependência de dados de fabricantes; \n●​\nnão avaliação clínica direta. \n3. Listar caminhos futuros: \n●​\nbenchmarking experimental; \n●​\nintegração com IA; \n●​\nestudos clínicos. \n→ Onde: Final do manuscrito \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C7.  \nSTATUS - Encarregado \nThe abstract does not faithfully mirror scope and objectives. It lists general concepts with no quantifiable \nachievements. \n \n1. Reescrever o Abstract para conter: \n●​\nnúmero de dispositivos; \n●​\nmétodo (PRISMA-ScR); \n●​\nprincipal resultado (mapeamento + adoção). \n2. Evitar termos genéricos.\n\n3. Usar números sempre que possível. \n→ Onde: Abstract \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C8.  \nSTATUS - Encarregado \nThe article lists devices but does not benchmark them technically. \n \n1. Criar benchmark indireto, baseado em: \n●​\ncategorias (baixa/média/alta densidade); \n●​\nadequação a tempo real; \n●​\naplicações típicas. \n2. Deixar explícito que: \n●​\nnão é benchmarking experimental. \n→ Onde: Results e Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2C9.  \nSTATUS - Encarregado \nIt may be beneficial to include a section titled “Clinical, Industrial, and Societal Deployment Pathways,” \nwhere potential deployment scenarios and their constraints are discussed. \n \n1. Criar uma nova seção com esse título: “Clinical, Industrial, and Societal Deployment Pathways” \n2. Discutir brevemente: \n●​\nuso clínico; \n●​\nbarreiras hospitalares; \n●​\ncusto e regulamentação. \n3. Relacionar dispositivos a cenários reais. \n→ Onde: Discussion \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nAdditional Questions \nR2AQ1.  \nSTATUS - Encarregado \nDoes the paper contribute to the body of knowledge? The manuscript contributes a valuable \nmarket-mapping dataset of 96 wireless EEG and fNIRS devices (125 including variants), compiled via a \nPRISMA-ScR protocol and OSF registration. This large-scale technical catalog is useful for researchers \nmaking device-selection decisions. However, its scientific advancement is limited, because the paper is\n\nprimarily descriptive and does not provide critical synthesis, benchmarking, or analytical interpretation of \ndevice performance, clinical applicability, or research validation. \n \n1. Transformar o texto atual em uma resposta afirmativa clara. \n2. Reconhecer o caráter descritivo. \n3. Explicar por que o mapeamento ainda é uma contribuição científica válida. \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2AQ2.  \nSTATUS - Encarregado \nIs the paper technically sound? Partially, with methodological gaps that weaken its rigor. There is no \nbenchmarking, device validation, or SNR/latency/impedance comparative analysis, lack of reproducibility \ninformation (reviewer count, exclusion rules, search strings), reliance on self-reported manufacturer data \nwithout verification. \n \n1. Reconhecer limitações metodológicas explicitamente. \n2. Justificar escolhas metodológicas. \n3. Evitar qualquer afirmação de validação técnica direta. \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR2AQ3.  \nSTATUS - Encarregado \nIs the subject matter presented in a comprehensive manner? The manuscript thoroughly lists devices, \nspecifications, bibliometric usage, and general technological considerations. However, several major \ndomains expected in a “comprehensive review” are missing or insufficiently developed, such as, no inclusion \nof 2023–2025 state-of-the-art advances (e.g., EEG-transformers, multimodal AI, federated EEG learning, \nbiosignal foundation models), limited discussion of translational pathways (clinical use, hospital deployment \nbarriers, regulatory context, cost-effectiveness), no roadmap or identification of future research gaps. \n \n1. Inserir referências 2023–2025 estratégicas. \n2. Criar um roadmap futuro. \n3. Relacionar tecnologia, clínica e sociedade. \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nReviewer 3 \nR3C1. \nPARCIALMENTE RESOLVIDO - claudio\n\nThe abstract states: \"2,087 studies explicitly reported the use of brain devices... resulting in a true positive \nrate of 55.79%.\" The term \"true positive rate\" is typically used in classification/diagnostic contexts \n(sensitivity = TP/(TP+FN)). In a literature search, this terminology is confusing. What constitutes a \"false \nnegative\" in your search strategy? Are you referring to the precision of your search query (relevant papers / \ntotal retrieved papers)? Please clarify this metric. If you mean that 55.79% of the screened papers were \nrelevant (i.e., actually used brain devices), use standard systematic review terminology such as \"inclusion \nrate\" or \"relevance rate.\" Provide a PRISMA flow diagram showing the exact numbers at each screening \nstage. \n \n1. Substituir completamente o termo true positive rate por “inclusion rate” em todo o artigo. \n2. Inserir na seção Methods uma definição formal: \n●​\nInclusion rate = (nº de estudos que realmente usaram o dispositivo) / (nº total de registros \nrecuperados). \n3. Deixar claro que: \n●​\nnão há “false negatives”; \n●​\ntrata-se de eficiência da estratégia de busca, não métrica diagnóstica. \n4. Garantir que o fluxograma PRISMA mostre: \n●​\nregistros recuperados; \n●​\nexcluídos por falso positivo (nome ambíguo, menção sem uso); \n●​\nincluídos finais. \n→ Onde: Abstract, Methods, Results, PRISMA Figure \n \nResponse To Reviewers \nWe agree with the reviewer that the term true positive rate is inappropriate in the context of a \nliterature search. The manuscript has been revised to replace this term with inclusion rate, which \nis consistent with systematic review terminology. The inclusion rate is now explicitly defined in the \nMethods section as the proportion of retrieved records that explicitly applied the named brain \ndevice as an experimental or clinical tool, reflecting the precision of the device-specific search \nqueries, rather than sensitivity or recall. The Abstract and Results sections were updated \naccordingly to report that 2,087 of 3,741 unique records met the inclusion criteria, yielding an \noverall inclusion rate of 55.79%. A PRISMA flow diagram has also been added to report the \nnumber of records retrieved, duplicates removed, records screened, and studies included at each \nstage. \n \n \n​\nR3C2. \nSTATUS - claudio   \nThe manuscript states that 96 devices were \"tracked in the market\" but does not describe the market survey \nmethodology. How were the 96 devices identified? Was there a systematic search of manufacturer websites, \nregulatory databases (e.g., FDA, CE marking), or commercial catalogs? Were devices from China, India, or \nother non-Western markets included? Requirement: Add a dedicated subsection in the Methods describing \nthe device identification protocol. Include: 1. Search terms used (e.g., \"wireless EEG,\" \"portable fNIRS\"); 2. \nDatabases/sources consulted (e.g., Google Scholar, manufacturer websites, ResearchGate equipment lists); \n3. Inclusion/exclusion criteria (e.g., \"commercially available as of August 2025,\" \"wireless only\"); 4. A \nsupplementary table listing all 96 devices with manufacturer, model number, and year of market entry. \n \n1. Criar uma subseção nova em Methods chamada: “Device identification and market survey \nprotocol” \n2. Descrever claramente:\n\n●​\ntermos de busca usados (ex.: “wireless EEG”, “portable fNIRS”); \n●​\nfontes consultadas: \n○​\nsites de fabricantes; \n○​\nGoogle Scholar; \n○​\ncatálogos comerciais; \n○​\nliteratura científica. \n3. Especificar critérios de inclusão: \n●​\ndispositivo comercialmente disponível; \n●​\nportátil e/ou wireless; \n●​\nEEG e/ou fNIRS; \n●​\ndisponível até mês/ano definido. \n4. Especificar critérios de exclusão: \n●​\nprotótipos acadêmicos; \n●​\ndispositivos descontinuados; \n●​\nsoftwares sem hardware. \n5. Confirmar explicitamente: \n●​\ninclusão de dispositivos de mercados não ocidentais (China, Índia). \n6. Criar uma tabela suplementar com: \n●​\nfabricante; \n●​\nmodelo; \n●​\nano de entrada no mercado. \n→ Onde: Methods + Supplementary Material \n \nRESPONSE TO REVIEWERS \nText… \n \n \n \nR3C3. \nSTATUS - claudio   \nThe manuscript reports percentages (e.g., Epoc X = 19.30%, OpenBCI = 4.81%) but lacks deeper statistical \nanalysis. These percentages suggest a highly skewed distribution (a few devices dominate, while most have \nminimal adoption). This is a classic \"long-tail\" phenomenon. Requirement: 1. Provide a Lorenz curve or Gini \ncoefficient to quantify the inequality in research adoption; 2. Perform a correlation analysis: 2.1. Does \ndevice cost negatively correlate with adoption rate? 2.2. Does channel count positively correlate with \ncitation frequency? 2.3. Use regression analysis to identify which technical specifications (e.g., open API, dry \nelectrodes, price) predict research adoption. \n \n1. Gerar uma Curva de Lorenz para adoção dos dispositivos. \n2. Calcular o coeficiente de Gini da distribuição de citações. \n3. Fazer análises simples: \n●​\ncorrelação entre preço vs adoção; \n●​\ncorrelação entre nº de canais vs adoção. \n4. Rodar uma regressão exploratória com variáveis como: \n●​\nopen API (sim/não); \n●​\ntipo de eletrodo (seco/molhado); \n●​\npreço aproximado. \n5. Deixar explícito que a análise é exploratória, não causal. \n→ Onde: Results + Figures + Methods (estatística) \n \nRESPONSE TO REVIEWERS \nText…\n\nR3C4.  \nPARCIALMENTE RESOLVIDO - claudio \nThe abstract mentions \"a significant gap between consumer-grade and research-grade technologies\" but \ndoes not define these categories. Is the classification based on price, signal quality (SNR), regulatory \napproval (FDA Class II), or intended use? Requirement: 1. Provide explicit criteria for this classification. For \nexample: 1.1. Consumer-grade: < $500, < 8 channels, dry electrodes, primarily marketed for \nmeditation/gaming; 1.2. Research-grade: > $5,000, > 32 channels, wet/gel electrodes, medical-grade \ncertification. \n \n1. Criar critérios explícitos em Methods ou Results: \n2. Aplicar essa classificação de forma consistente. \n3. Ajustar o Abstract para refletir essa definição. \n4. Inserir na tabela a classificação “Grade: consumer / research / clinical” \n→ Onde: Methods, Results, Abstract \n \nRESPONSE TO REVIEWERS \nWe have added an explicit definitional paragraph clarifying that the classification of EEG devices is based on \nintended use, technical specifications, signal quality, and regulatory status. This paragraph was placed \nbefore the detailed technical comparison to improve conceptual clarity and directly address the reviewer’s \nconcern. This classification framework is supported by prior studies distinguishing consumer-grade, \nresearch-grade, and clinical-grade EEG systems based on these criteria (Chuang and Lin, 2019; Doudou et \nal., 2020; Huang et al., 2020; Grasso-Cladera et al., 2023). \n \n \n​\nR3C5. \nSTATUS - Encarregado \nThe manuscript mentions devices \"currently available\" but does not analyze temporal evolution. The \nneurotechnology market has evolved rapidly. Early devices (e.g., NeuroSky MindWave, 2009) differ \nsignificantly from recent models (e.g., Kernel Flow, 2023). Requirement: 1. Add a timeline figure showing \nwhen each device entered the market; 2. Analyze trends: 2.1. Has the average channel count increased over \ntime? 2.2. Has the price per channel decreased (Moore's Law for neurotechnology)? 2.3. When did wireless \narchitectures become dominant? \n \n1. Criar uma linha do tempo mostrando ano de entrada de cada dispositivo no mercado. \n2. Analisar tendências simples: \n●​\naumento do nº médio de canais ao longo do tempo; \n●​\nredução do custo por canal; \n●​\ntransição para arquiteturas wireless. \n3. Relacionar essas tendências à evolução tecnológica geral. \n→ Onde: Results, Figures, Discussion \n \nRESPONSE TO REVIEWERS \nText…\n\nR3C6.  \nSTATUS - Encarregado \nThe manuscript states \"125 models and variants\" but does not explain how variants were handled in the \nanalysis. If a study used \"Epoc\" (2009) and another used \"Epoc X\" (2018), were these counted separately or \naggregated? The Epoc X has significant hardware improvements (5-electrode reference system, improved \nwireless). Clarify the aggregation strategy. If variants were pooled, justify this decision. If kept separate, \nprovide a breakdown showing which specific variant was most cited. \n \n1. Explicar claramente a estratégia adotada: \n●​\nvariantes agrupadas por família ou \n●​\nvariantes tratadas separadamente. \n2. Justificar a decisão: \n●​\nsemelhança técnica; \n●​\ncontinuidade comercial. \n3. Se variantes foram separadas, apresentar qual versão foi mais citada. \n4. Incluir essa explicação em Methods. \n→ Onde: Methods, Supplementary Table \n \nRESPONSE TO REVIEWERS \nText… \n \n \nFINAL STATEMENT \nWe believe that the revised manuscript has substantially improved in clarity, analytical depth, \nmethodological transparency, and translational relevance. We sincerely thank the reviewers and \nthe Associate Editor for their valuable feedback and hope that the revised version meets the \nstandards of IEEE Access.",
  "total_caracteres": 30094
}