{
  "arquivo": "Artigo-Revisado.pdf",
  "caminho_original": "C:\\Users\\FELIPE BITENCOURT\\.gemini\\antigravity\\scratch\\Artigo-Brain_devices\\Artigo-Revisado.pdf",
  "data_extracao": "2026-01-11T20:22:17.408347",
  "total_paginas": 16,
  "metadados": {
    "format": "PDF 1.4",
    "title": "rev_artigoBrainDevices_26_v1 ",
    "author": "",
    "subject": "",
    "keywords": "",
    "creator": "",
    "producer": "Skia/PDF m145 Google Docs Renderer",
    "creationDate": "",
    "modDate": "",
    "trapped": "",
    "encryption": null
  },
  "paginas": [
    {
      "numero": 1,
      "texto": "Brain Monitoring Devices for Neuroscience: A Review of Current Technologies \ndoi: 10.1109/ACCESS.2024.0429000 \n \nThis work was supported by the National Council for Scientific and Technological Development \n(CNPq), Brazil, under Grant 443965/2024-2, and by the Coordination for the Improvement of Higher \nEducation Personnel (CAPES), Brazil, Finance Code 2143671. \n \nAbstract \nThis scoping review provides a technical characterization of 96 wireless brain monitoring devices \n(EEG and fNIRS), totaling 125 models and variants, currently available on the global market. A \nscientific characterization was performed by systematically searching the literature following \nPRISMA guidelines and registered in the OSF. The search was conducted across five databases (IEEE, \nScopus, PubMed, Web of Science, and Embase) to identify the applications of the devices tracked in \nthe market. The searches were conducted between January and August 2025. A total of 5,071 \nrecords were analyzed; 3,741 were unique entries. Among these, 2,087 studies explicitly reported \nthe use of brain devices in clinical trials, dataset development, or technology evaluations, with an \noverall inclusion rate of 55.79\\% after screening. Research adoption was quantified by the number of \nDOI-indexed publications referencing each device. The Epoc X leads the number of research \npublications with 19.30\\%, followed by the OpenBCI system with 4.81\\%, and the MindWave with \n4.06\\%. Enobio appears in fourth place with 2.89\\% and g.Nautilus ranks eighth with 1.71\\%. These \nfindings demonstrate a global effort by researchers to conduct accessible studies using user-friendly, \nlow-cost, and widely available devices, revealing a significant gap between consumer-grade and \nresearch-grade technologies. The compiled dataset provides an evidence-based framework to guide \nneuroscientists, engineers, and clinicians in selecting the appropriate device for their specific \nresearch needs. This work also identifies critical trends, such as the strong convergence toward \nwireless architectures and the growing emphasis on open data interfaces. \n \nKeywords \nBiomedical Instrumentation, Brain-Computer Interfaces, Electroencephalography (EEG), Functional \nNear-Infrared Spectroscopy (fNIRS), Wireless Neurotechnology. \n \nIntroduction \nAdvances in neurotechnology have profoundly transformed the field of neurorehabilitation, enabling \ntargeted stimulation of neuroplasticity, data-driven clinical decision-making, and continuous \nmonitoring of brain activity in both laboratory and real-world settings. These systems integrate \nsensor-based monitoring, signal processing, and computational modeling to generate objective \nindicators of brain function, enhancing the precision, reproducibility, and personalization of \ntherapeutic interventions. The emergence of portable, wireless, and cost-effective brain monitoring \ndevices has further democratized access to neuroscience tools, allowing the acquisition of \nhigh-quality neural data under ecologically valid and movement-rich conditions that better reflect \nfunctional behavior in daily life. \n \nAmong noninvasive neuroimaging modalities, electroencephalography (EEG) and functional \nnear-infrared spectroscopy (fNIRS) have become fundamental in both clinical and experimental \nneuroscience. EEG records electrical potentials with high temporal resolution, providing direct \ninsight into neuronal dynamics and oscillatory activity. Its portability, affordability, and compatibility \nwith wearable architectures make it particularly suitable for neurofeedback and brain–computer \ninterface (BCI) applications. In contrast, fNIRS measures hemodynamic changes associated with",
      "caracteres": 3693
    },
    {
      "numero": 2,
      "texto": "cortical activation by detecting oxygenation-dependent absorption of near-infrared light. Although it \nprovides lower temporal resolution than EEG, fNIRS achieves higher spatial location and greater \nrobustness against electrical interference. When combined, EEG and fNIRS offer complementary \ninformation—temporal precision and hemodynamic specificity—creating multimodal platforms \ncapable of characterizing the neural mechanisms underlying movement, learning, and recovery. \n \nIn neurorehabilitation, these multimodal monitoring systems enable quantification of functional \nrecovery and optimization of individualized therapy programs. They support closed-loop \nneurofeedback by providing brain-derived real-time metrics that guide adaptive training and \npromote cortical reorganization after neurological injury. When embedded in immersive or gamified \nenvironments, such systems enhance engagement and motivation, bridging neuroscience and \nrehabilitation engineering. The resulting datasets not only inform clinical decisions but also \ncontribute to large-scale neurophysiological research through standardized and reproducible \nacquisition protocols. \n \nDespite their growing potential, selecting the most appropriate brain monitoring device remains a \nmajor challenge. The commercial landscape has expanded rapidly, encompassing numerous \nmanufacturers and models with heterogeneous technical specifications, including differences in \nsignal quality, channel count, electrode or optode design, wireless architecture, data accessibility, and \nintegration capabilities. This diversity, coupled with the absence of standardized technical reporting, \nhinders direct comparison between systems and complicates the alignment of device performance \nwith specific experimental or therapeutic goals. As a result, decision-making often becomes complex \nand time-consuming, resembling the paradox of choice, where an excess of alternatives may obscure \noptimal selection. \n \nTo address this gap, the present work goes beyond existing wireless EEG and multimodal \nneurotechnology surveys by providing a large-scale, device-level mapping and technical \ncharacterization of commercially available EEG and fNIRS systems relevant to neuroscience and \nneurorehabilitation research. Unlike prior reviews that focus primarily on signal processing methods, \nexperimental paradigms, or small subsets of devices, this study systematically analyzes 96 \ncommercially available systems using manufacturer documentation, technical manuals, patents, and \nsecondary literature. The resulting framework integrates engineering specifications with \napplication-oriented criteria, including connectivity, data access, synchronization support, and \nproxy-based closed-loop readiness, as well as bibliometric indicators of device adoption in the \nliterature. By combining technical, applicational, and adoption-level perspectives, this review offers a \ntranslationally oriented resource that is not available in existing surveys. \n \nBy integrating these dimensions, this review offers a decision-support framework to guide scientists, \nengineers, and clinicians in selecting brain monitoring technologies that are best suited to their \nmethodological and operational requirements. Ultimately, its goal is to strengthen the interface \nbetween biomedical engineering and clinical neuroscience, accelerating the translation of portable \nbrain monitoring systems into real-world neurorehabilitation contexts and advancing the \ndevelopment of evidence-based neurotechnological practice. \n \nBackground \nSeveral studies have directly addressed the scope of this work, providing relevant findings and \ninsights. According to [1], EEG remains a preferred modality in neuroscience and BCI research due to \nits widespread familiarity and high temporal resolution, which makes it particularly suitable for",
      "caracteres": 3869
    },
    {
      "numero": 3,
      "texto": "applications such as mental state classification, motor imagery, brain–computer interfaces, robotic \ncontrol, and neuroadaptive games.  \n \nReference [2] conducted a standardized comparison of six EEG systems, isolating signal quality from \nclassifier performance. The active gel-based system achieved the highest signal-to-noise ratio (SNR), \nfollowed by a passive gel system, while other passive and dry electrode systems exhibited reduced \nperformance because of design and contact limitations. The Saline-based electrodes showed the \nlowest signal quality. Despite lower SNR, wireless and dry systems are often favored in short-term or \nuser-oriented contexts for their comfort and usability. For clinical or high-performance BCI \napplications, high-end systems remain the most reliable, though mid-range commercial devices may \noffer a cost-effective balance of signal quality and operational flexibility.  \n \nA study summarizes general technical specifications for six EEG devices and notes that several \nstudies have empirically evaluated the effectiveness of these wearable neurotechnologies in \nfundamental research and BCI applications [3]. Reference [4] presents a comprehensive review of \ndriver drowsiness detection systems, examining 24 EEG-based technologies that use physiological \nbrain signals to determine drowsiness and wakefulness.   \n \nAn overview of wireless EEG hardware is provided by [5]. This comprehensive survey includes 48 \nwireless EEG devices, outlining key features and specifications to enable side-by-side comparisons \nand support informed hardware selection. Additionally, it reviews 110 publications that employed \nwireless EEG, categorizing them by application and analyzing factors such as the devices used, \nnumber of channels, sample sizes, and participant mobility. Complementing this analysis, the paper \nprovides background information and critical commentary on the challenges and considerations \ninherent to wireless EEG research, offering valuable insights.  \n \nAs noted by [6], BCIs enable brain–device communication, typically via EEG. Common systems range \nfrom single-channel dry electrodes for targeted monitoring to saline-based devices offering broader \nfunctionality. Lightweight multichannel setups are preferred for comprehensive recordings, while \nheadband-style devices are often used in gaming and sleep assessments. Dry electrodes are generally \nfavored over wet ones due to reduced setup time and improved comfort. Device selection depends on \nthe application and critical parameters such as sampling rate, resolution, battery life, and electrode \ncount.  \n \nEEG devices are commonly categorized based on a combination of intended use, technical \nspecifications, signal quality, and regulatory status, rather than a single criterion such as price or \nchannel count. Consumer-grade EEG systems are generally low-cost, portable, and easy to deploy, \nand are primarily marketed for non-clinical applications such as neurofeedback, gaming, wellness, \nand exploratory experimentation. These systems typically feature a limited number of channels, \nprioritize usability and comfort, and often employ dry or semi-dry electrodes, which may constrain \nsignal robustness. Research-grade EEG systems are designed for academic and laboratory use and \nprovide higher channel counts, improved signal-to-noise ratio, flexible acquisition parameters, and \nfull access to raw data, supporting rigorous experimental protocols. Clinical-grade (or medical-grade) \nEEG systems are certified for diagnostic and clinical applications and must comply with stringent \nregulatory standards for safety, reliability, and performance, including formal medical device \napproval. Overall, this classification reflects increasing levels of data quality, experimental control, \nand regulatory compliance across consumer, research, and clinical contexts [Chuang and Lin, 2019], \n[Doudou et al., 2020].",
      "caracteres": 3932
    },
    {
      "numero": 4,
      "texto": "According to [7], wet-electrode EEG systems classified as research-grade or clinical-grade typically \ncomprise 32 to 256 channels, cost tens of thousands of dollars, and offer high signal stability suitable \nfor advanced analyses in controlled laboratory or clinical environments. However, these systems \nrequire trained personnel, setup times of approximately 15–30 minutes, and post-recording hair \nwashing, which limits their usability outside laboratory settings. Despite these constraints, they \nprovide scalable architectures and reliable access to raw signals, although the availability of \nembedded algorithms is often limited. In contrast, dry-electrode EEG systems, commonly associated \nwith consumer-grade and some research-grade devices, are generally priced under a few thousand \ndollars, support 1 to 64 channels, and allow rapid setup (typically under 10 minutes) without the need \nfor hair washing. These systems offer higher user comfort and wireless operation, enabling mobile \nand hyperscanning recordings, but may exhibit greater variability in signal stability. \n \nFrom a signal quality perspective, consumer-grade EEG systems tend to perform adequately under \nhigh signal-to-noise ratio (SNR) conditions, such as event-related potential (ERP) paradigms \nconducted in controlled environments. However, their performance often degrades in real-world, \nlow-SNR scenarios, particularly in mobile or naturalistic settings. Empirical evaluations indicate that \nresearch-grade systems, especially those with higher sensor density, yield more reliable and \nreproducible data under such conditions. These findings suggest that, despite their practical \nadvantages, consumer-grade devices may be insufficient for studies requiring robust signal quality in \necological environments, underscoring the need for further advancements in dry-electrode \ntechnology to bridge this gap [8]. \n \nReference [9] conducted a large-scale review of the technical specifications of 16 wireless EEG \nsystems from multiple manufacturers. The study shows a comparative analysis of key features, \nunderscoring the increasing accessibility and formal classification of wireless EEG technologies. \n \nAnother study [10] presents a table of 31 devices focused on measuring brain activity related to the \ncentral nervous system, highlighting key market players and their most representative products. \nReference [11] classifies 22 brain monitoring devices based on their primary applications: executive \nfunction, psychomotor skills, and behavioral, emotional, and sensory domains. Study selection and \nanalysis were systematically conducted following the PRISMA-ScR framework.  \n \nReference [12] reports the development of a low-cost EEG system and compares commercial devices \nranging from USD 300 to 50,000. High-end prices reflect regulatory certifications required for \nclinical use, which are often unnecessary for non-clinical BCIs. The limited availability of affordable, \nhigh-quality options leads researchers to rely on costly clinical-grade systems. As costs scale with \nchannel count, reducing electrode number and optimizing spatial placement can improve \ncost-efficiency without compromising performance.  \n \nPassive EEG electrodes transmit signals directly to the amplifier, while active electrodes incorporate \na preamplifier. Reliable recordings require stable electrode–scalp contact, shielding against \nelectromagnetic interference, and consistent signal acquisition. Improved contact enhances noise \nidentification and data reliability, potentially reducing the required sample size (n). Skin impedance \ndecreases from \\SI{\\sim200}{\\kilo\\ohm} (uncleaned) to \\SI{\\sim120}{\\kilo\\ohm} (cleaned), with \nfurther reduction achievable through exfoliation or alcohol application at the electrode site [13].  \n \nWet EEG electrodes with gel provide low impedance (\\SI{<10}{\\kilo\\ohm}) but require skin \npreparation, electrolyte application, and cleaning. Signal quality declines as the gel dries, limiting its \nsuitability for non-clinical use. Saline-based electrodes offer an alternative but may irritate abraded",
      "caracteres": 4113
    },
    {
      "numero": 5,
      "texto": "skin and promote oxidation, reducing lifespan [13], [14]. Dry electrodes enable faster setup; although \nimpedance is higher, advanced algorithms reduce noise and artifacts. Well-designed dry systems \ncombining optimized materials, placement, and shielding can achieve signal quality comparable to \nwet systems [14], [15], [16], [17]. Silver electrodes coated with silver chloride (Ag/AgCl) remain the \ngold standard due to their corrosion resistance [18].  \n \nFurthermore, low-cost EEG modules, typically compatible with open-source development platforms, \nhave emerged as accessible alternatives for initial investigations, educational purposes, and \nnon-clinical research. However, their limited functionality and susceptibility to noise constrain their \nuse in high-precision applications [19].  \n \nThe common-mode rejection ratio (CMRR) of driven right leg (DRL) circuits is essential for minimizing \ncommon-mode noise in biopotential recordings. DRL systems operate by inverting the \ncommon-mode voltage, detected via a common-mode sense (CMS) electrode, and feeding it back to \nthe participant through the DRL electrode. This negative feedback reduces interference at the \namplifier inputs, enhancing CMRR and signal fidelity. Combined, CMS and DRL improve noise \nrejection and overall recording reliability [20].  \n \nThe lab streaming layer (LSL) enables precise multimodal synchronization without hardware triggers, \nsupporting seamless integration with platforms such as MATLAB, Python, OpenViBE, BCI2000, and \nUnity. It synchronizes EEG, video, peripheral sensors, and stimulus markers for real-time applications, \nenhancing interoperability and scalability in research [21].  \n \nThe fNIRS measures cortical oxygenation and blood flow up to \\SI{\\sim15}{\\milli\\metre} depth using \nred and near-infrared light. Emitted light penetrates the scalp and skull, interacts with brain tissue, \nand is detected by infrared sensors positioned a few centimeters away. Absorption patterns, \ninfluenced by changes in hemoglobin saturation, allow inference of cortical activity. Red light is \nprimarily absorbed by oxygenated hemoglobin, while near-infrared light reflects total blood \nconcentration. Short source–detector separations minimize contamination from superficial tissues, \nenhancing signal specificity [22].  \n \nLatency, response time, jitter, and throughput are key performance metrics in wireless EEG and fNIRS \nsystems, influencing reliability and real-time operation. Latency is the delay from neural or \nhemodynamic activity to its digitized signal; response time adds processing delays. Jitter, or \nvariability in these times, reduces temporal precision, while throughput, the rate of successful data \ntransmission, often trades off with latency. Optimizing these metrics is essential for temporal \nresolution, data integrity, and real-time responsiveness [23], [24], [25], [26]. \n \nBrain \nmonitoring \ndevices \nincreasingly \nintegrate \nmultimodal \nbiosensors, \nincluding \nelectrocardiography (ECG), photoplethysmography (PPG), pulse oximetry, and blood pressure for \ncardiovascular \nmonitoring; \nelectromyography \n(EMG) \nand \nelectrooculography \n(EOG) \nfor \nneuromuscular and ocular activity; and inertial measurement units (IMU), respiration sensors, and \nballistocardiography (BCG) for motion and breathing. Galvanic skin response (GSR) and thermal \nsensors track skin conductance and temperature, while some systems add eye tracking and \nlight-based neuromodulation, such as transcranial photobiomodulation (tPBM) and near-infrared \nphotobiomodulation (NIR-PBM).",
      "caracteres": 3582
    },
    {
      "numero": 6,
      "texto": "Method \nThis scoping review employed a structured documentary approach to identify and characterize \ncommercially available brain-monitoring devices. Data were collected from both primary scientific \nliterature and secondary sources, including patents, user manuals, and manufacturer websites. \nDevices were included based on the following criteria: (i) noninvasive neurotechnologies; (ii) portable \nform factor suitable for clinical or field use; (iii) commercial availability in the global market; (iv) sold \nas complete bundled systems rather than modular components; and (v) demonstrated or potential \nrelevance to neuroscience and neurorehabilitation applications.  \n \nTo define the technological scope of the review, MeSH categories were consulted. “Diagnostic \nTechniques and Procedures” was selected as the overarching classification encompassing \nbrain-monitoring modalities across the target databases. Identified technologies included EEG, HEG, \nNIRS, fNIRS, PET, MEG, MRI, and fMRI. However, the final analysis focused exclusively on \nnoninvasive, portable, and wireless EEG and fNIRS devices.  \n \nDatabase searches were conducted from March to August 2025 across five platforms: IEEE Xplore, \nPubMed/MEDLINE, Web of Science, Scopus, and Embase. Each search employed a Boolean query \ncombining device name, manufacturer, and technology terms (e.g., “device” AND “manufacturer” \nAND “EEG/fNIRS”). Queries were adapted to the syntax and indexing structure of each database. \nIEEE Xplore was used for engineering and hardware design; PubMed/MEDLINE for its coverage of \nbiomedical literature; Web of Science and Scopus for multidisciplinary indexing and citation tracking; \nand Embase for its emphasis on medical devices and international content.  \n \nAn inclusion rate was used as a measure of search efficiency for each device-specific query. All \nretrieved records were screened to determine whether the named brain device was effectively \napplied as an experimental or clinical tool in the study; records in which the device name referred to \nan unrelated entity (e.g., personal names or acronyms with different meanings) or in which the device \nwas merely mentioned without actual use were excluded. The inclusion rate was defined as the \nproportion of retrieved records that met the inclusion criterion of explicit device application, \ncalculated as: \nInclusion rate = \nNumber of included studies using the device \nTotal number of records retrieved for that device \n \nThis metric reflects the precision of the device-specific search strategy, rather than sensitivity or \nrecall, and was used to quantify the effectiveness of each query in identifying studies with confirmed \ndevice usage. \n \nThe number of DOI-indexed publications referencing each identified device was recorded to assess \nresearch use. No language or date restrictions were applied. \n \nA summary table was compiled for all eligible devices, including technical parameters such as the \nnumber of channels, electrode type, sampling rate, data connectivity, software availability, and \nintended application. Additionally, peer-reviewed articles reporting experimental or clinical use of \neach device were identified to verify relevance, deployment, and impact across neuroscience and \nbiomedical engineering domains.  \n \nThe protocol of this scoping review was prospectively registered in the Open Science Framework \n(OSF) under the registration DOI: 10.17605/OSF.IO/EMRH8.",
      "caracteres": 3455
    },
    {
      "numero": 7,
      "texto": "Results \nA total of 5,071 records were retrieved from the selected scientific databases based on the inclusion \ncriteria. After removing 1,331 duplicates (26.25\\%), 3,741 unique records remained. Of these, 2,087 \nstudies explicitly reported the use of brain monitoring devices in clinical trials, dataset development, \nor technological assessments, yielding an inclusion rate of 55.79\\% after title, abstract, and full-text \nscreening. Eighty records (2.14\\%) were excluded due to a lack of access. Supplementary technical \ninformation was obtained from manufacturers’ websites and consolidated in Table 1, comprising 96 \ndevices, 125 when including model variants. Research adoption was quantified by the number of \nDOI-indexed publications referencing each device. No critical appraisal of individual sources of \nevidence was performed, as this scoping review aimed to map the extent and nature of the literature \nwithout assessing study quality.  \n \nTable 1. Portable and Wireless Brain Monitoring Devices (2025 Worldwide Commercial Availability) \n \nFootnote. Closed-loop readiness represents a proxy-based classification of device suitability for \nreal-time and closed-loop applications. This indicator is inferred from transmission-related",
      "caracteres": 1248
    },
    {
      "numero": 8,
      "texto": "specifications, including wireless communication protocol, channel count, nominal sampling rate, and \ndata access capabilities. It does not reflect experimentally measured latency or jitter, nor does it \nimply regulatory certification or guaranteed real-time performance. \n \nTable Description \nTable 1 summarizes the technical, functional, and bibliometric characteristics of the EEG devices \nidentified in this scoping review. The table reports the monitoring technology and commercial model, \ntogether with the device type, usage grade, manufacturer, and country of origin. The grade column \nclassifies devices as consumer-grade, research-grade, or clinical-grade according to their intended \nuse, technical capabilities, and regulatory context, providing a high-level distinction between \nwellness-oriented, research-focused, and clinically certified systems. \n \nSensor-related information includes electrode type and sensor technology, reflecting conductive \nmedia requirements, signal acquisition principles, and factors affecting signal quality, noise \nsusceptibility, and user comfort. Hardware configuration is described by the number of recording \nchannels and electrode positioning, while wireless connectivity specifies the communication \ntechnology used for data transmission. \n \nParameters relevant to data acquisition include the nominal sampling rate and analog-to-digital \nconverter (ADC) resolution. Raw data access indicates whether unprocessed EEG signals are \navailable to the user. Closed-loop readiness provides a proxy-based classification of device suitability \nfor real-time and closed-loop applications, categorized as Low, Medium, or High, and inferred from \ntransmission-related specifications, including wireless communication protocol, channel count, and \nnominal sampling rate. This classification supports a comparative assessment of real-time \ntransmission constraints and performance trade-offs, without implying regulatory certification, \nexperimentally validated latency or jitter, or guaranteed real-time performance. These proxy \nparameters reflect timing and bandwidth constraints relevant to closed-loop applications, such as \nreal-time neurofeedback, adaptive BCI control, and event-locked multimodal synchronization. \n \nSoftware-related aspects are reported through bundled software and data synchronization. Bundled \nsoftware describes the availability and licensing model of manufacturer-provided software for data \nacquisition, control, or visualization, including desktop, mobile, web-based, or cloud applications, \nwhether included, freely available, open-source, subscription-based, or sold separately. Data \nsynchronization indicates the availability of software interfaces and communication protocols, such \nas SDKs, APIs, LSL, or TCP, that enable event-based and temporal alignment of EEG data streams with \nexternal systems or multimodal sources. Auxiliary capabilities summarize additional integrated \nfunctionalities, such as inertial sensors or embedded analytics. \n \nFinally, price information, when available, is reported in U.S. dollars, excluding taxes and shipping, \nwith currency conversion applied as needed; in cases where prices were not publicly disclosed, \nmanufacturers were contacted, although such values are not shown to account for confidentiality \nand variability in purchasing terms. The bibliometric columns report the number of peer-reviewed \nstudies using each device and the corresponding inclusion proportion, representing the share of \nincluded records in which the device was explicitly applied. \n \nDevice design varies substantially across categories. Caps streamline setup, enhance sensor contact, \nand optimize signal quality. Headsets, resembling headphones, combine ease of use with safety, \nmaking them suitable for immersive clinical and non-clinical scenarios. Headbands provide",
      "caracteres": 3868
    },
    {
      "numero": 9,
      "texto": "lightweight, ergonomic form factors ideal for cognitive research, neurofeedback, and brain-computer \ninterfaces (BCI) in naturalistic environments. Earphones and headphones integrate auditory \nstimulation with EEG acquisition, while adhesive systems enable low-impedance, long-duration \nrecordings, useful in intensive care unit (ICU) and sleep studies. The fNIRS caps and headsets offer \nspatial mapping of cortical activity and are used in complex cognitive and motor studies. Multimodal \ndevices, including those integrating EEG with fNIRS, enhance spatial and temporal resolution, \nsupporting applications such as virtual reality (VR)-based neurorehabilitation. \n \nDiscussion of Results \nThis review focuses on device-level technical specifications, reported capabilities, and usage patterns \nacross the literature, rather than on experimental validation of signal quality or performance \nbenchmarking under controlled conditions. As validation protocols, signal-to-noise ratios, and \ncomparative performance metrics are highly task-, setup-, and population-dependent and are \ninconsistently reported across studies, a quantitative cross-device evaluation of signal quality was \nconsidered outside the scope of this scoping review. Instead, performance trade-offs between \ndevices were examined at an architectural and applicational level, considering factors such as channel \ncount, electrode technology, wireless communication protocol, data access, and software integration. \n \nThe 125 devices identified in this work span an impressive range of channel counts, from \nultra-compact single-channel units designed for basic biofeedback to full 150-channel \nresearch-grade rigs. Counts in the studies found column indicate not only device popularity but also \nempirical maturity, reflecting the availability of reliable estimates for signal-to-noise ratio (SNR), \nnoise spectral profiles, dropout rates, and operational parameters such as typical impedance, setup \ntime, and gain/analog-to-digital converter (ADC) stability. Devices with extensive literature typically \nexhibit well-characterized sensor geometries and analog front-ends, enabling informed technical \ndecisions on montage, preprocessing (bandpass, notch, referencing), artifact modeling (ICA \ntemplates, motion regression), and synchronization requirements for ERP or closed-loop paradigms. \nHowever, a high publication count does not eliminate methodological risks: firmware or driver \nupdates, raw data access policies, and reliance on proprietary pipelines may introduce systematic \nbiases and affect inter-site reproducibility. These factors require authors to report the firmware \nversion and exact acquisition conditions.  \n \nSome models are frequently cited (often due to accessibility and cost), while others show few or no \nreported applications, indicating a lack of independent validation. For studies requiring statistical \nrobustness and reproducibility (e.g., clinical ERP, connectivity analyses), selecting devices with \nsubstantial prior use reduces measurement bias risk. In exploratory or prototyping contexts, devices \nwith limited publications may still be valuable if accompanied by technical validation (pilot SNR, \ndropout, latency) and explicit discussion of generalization limits, as low study counts may reflect \nnovelty or barriers such as cost, licensing, or raw data availability.  \n \nSampling rates across these devices reflect their intended applications. Consumer-grade and \nlow-power BCI headsets often operate at 86–250 Hz, sufficient for basic cognitive and affective \nstudies. Most research-oriented systems, however, sample between 250 Hz and 1 kHz, supporting \nstandard ERP, spectral, and time–frequency analyses without aliasing. A few multimodal platforms \npush sampling rates up to 16 kHz to capture high-frequency EEG or evoked potentials with \nmillisecond precision, though this comes with increased demands for data storage and transmission.",
      "caracteres": 3960
    },
    {
      "numero": 10,
      "texto": "Bit depth is another critical differentiator. Lower-cost units typically employ 12–14-bit ADCs, \nadequate for classroom demonstrations or basic neurofeedback. Mid-tier research systems almost \nuniversally provide 16-bit resolution, offering a robust SNR for most experimental paradigms. \nPremium devices feature 24-bit or even 32-bit converters, minimizing quantization noise and \nmaximizing dynamic range for detecting subtle oscillatory phenomena or conducting source \nlocalization.  \n \nConnectivity options mirror trade-offs between mobility and data throughput. Bluetooth dominates \nthe entry and mid-range segments, enabling wireless operation at sampling rates up to 1 kHz with \nlatencies suitable for BCI control or ambulatory monitoring. A smaller subset of systems supports \nWi-Fi streaming, which is essential for multi-subject experiments (hyperscanning). \n \nThis scoping review focuses on device-level technical specifications and adoption patterns reported \nin the literature, rather than on clinical validation or experimental benchmarking of signal quality. \n \nLatency, jitter, and throughput were not reported as device-specific numerical values, as these \nmetrics are rarely disclosed by manufacturers and are highly configuration-dependent. In this review, \nthese parameters are therefore treated as application-level performance criteria, rather than \nexperimental measurements, and were integrated into the comparative framework using protocol- \nand data-rate–based proxies. Throughput requirements were inferred from channel count and \nnominal sampling rate, while latency and jitter were contextualized according to the wireless \ncommunication protocol. In this context, quantitative integration refers to the use of minimum \ndata-rate requirements and protocol-level constraints as comparative proxies, rather than to \nexperimentally measured latency or jitter values. \n \nSoftware support is a major consideration beyond hardware specifications. Approximately 70–80\\% \nof devices include their own acquisition and visualization suites; more advanced systems supplement \nthis with Python, MATLAB, or LabVIEW SDKs, enabling custom preprocessing, real-time artifact \nrejection, and precise synchronization with stimuli or other biosignals. Entry-level headsets may only \npermit audio-based triggers or manual markers, adequate for broad cognitive tasks but insufficient \nfor high-precision studies or closed-loop neuromodulation. \n \nBased on a renowned manufacturer whose devices are widely recognized in research, the cost of EEG \nsystems varies significantly with the number of channels, which directly affects spatial resolution and \nthe range of clinical or research applications. Lower-channel systems, such as 8-channel devices, are \npriced around \\$6,000 (USD), making them suitable for basic monitoring tasks, educational use, or \npreliminary research. As channel count increases, so does the system’s complexity and capabilities, \nresulting in higher costs. For instance, a 16-channel EEG device is priced at approximately \\$14,000, \nwhile a 32-channel system costs about \\$24,000. High-density EEG systems with 64 channels offer \nsuperior spatial resolution and advanced signal acquisition but are substantially more expensive, \noften exceeding \\$50,000. These price differences highlight the trade-offs between cost, signal \nquality, and application scope, underscoring the importance of selecting a system that aligns with the \nproject's specific needs and budgetary constraints. \n \nRegarding devices with electrode caps, the choice of base material is critical. Densely woven meshes \nand thick fabrics, such as neoprene, may cause discomfort due to increased scalp pressure and heat \nretention, given the head’s sensitivity to temperature variations. Excessive or uneven pressure can \ndegrade signal quality by affecting the electrode–skin interface, increasing impedance, and \nintroducing motion artifacts. Furthermore, sustained pressure may lead to thermal discomfort and",
      "caracteres": 4009
    },
    {
      "numero": 11,
      "texto": "sweating, which can further impair conductivity. Asymmetrical pressure distribution may also \nintroduce artificial asymmetries in the recorded data. Consequently, device design must prioritize \nergonomic fit and material selection to ensure user comfort while preserving signal integrity and data \nreliability. \n \nThe “Epoc X” device by Emotiv leads the number of research publications with 19.30\\%, followed by \nthe OpenBCI system with 4.81\\%, and the “MindWave Mobile 2” by Neurosky with 4.06\\%. All three \nare consumer-grade models. In fourth place appears the first research-grade device, the Enobio by \nNeuroelectrics, with 2.89\\%. The g.Nautilus by g.tec ranks eighth, representing 1.71\\% of usage in \npublished research. \n \nThese findings demonstrate a global effort by researchers to conduct accessible studies using \nuser-friendly, low-cost, and widely available devices, revealing a significant gap between \nconsumer-grade and research-grade technologies. \n \nIn summary, most rehabilitation-oriented neuroscience studies will find an optimal balance in 16 to \n32-channel devices sampling at 1 kHz with 16-bit resolution, Bluetooth streaming, and a \nuser-friendly SDK. For laboratories with greater demands for spatial resolution or multimodal \nrecording, premium systems—though more expensive and operationally demanding—offer \nunparalleled data quality and flexibility. By understanding how hardware and software parameters \ninteract, researchers can select a brain monitoring system that best balances spatial coverage, signal \nfidelity, mobility, and cost to meet their specific investigative goals. \n \nLimitations of Technologies Evaluated \nThe technologies applied in brain research have been fundamental in enhancing our understanding of \nthe nervous system and in developing interventions for neurorehabilitation. However, their use \ncomes with several limitations that can impact their effectiveness, applicability, and reach across \ndifferent contexts. These limitations span technical, economic, and operational aspects, all of which \nmust be carefully considered in the development and implementation of these tools. \n \nFrom a technical perspective, key challenges include resolution, accuracy, and response time. EEG, for \nexample, offers excellent temporal resolution but lower spatial resolution compared to fNIRS. \nResponse time is particularly critical for real-time applications such as neurofeedback and BCI \ndevelopment. Reliability is another concern, as noise and external interference can compromise data \nquality and reduce the effectiveness of the methods. EEG measures electrical activity from the \ncerebral cortex, but signal distortions occur as electrical potentials pass through the skull and scalp. \nThese signals range from approximately -90 mV at rest to 40 mV at the peak of an action potential \nand require amplification, an essential step that can also introduce additional noise. \n \nNoise sources include improper electrode placement, oxidized or deteriorated electrodes, weak scalp \nattachment, poor contact due to dry or oily skin, hair strands, dirt, and crusts. Additional sources \ninclude movement artifacts from muscle activity, blinking, heartbeats, and electromagnetic \ninterference caused by electrical transients, radio frequencies, and grounding issues. Given these \nchallenges, EEG devices require meticulous electronic design, careful assembly, and circuits for \nattenuating oscillating electromagnetic frequencies. Connections and circuits must be shielded, \ncables should be short and shielded, and electrodes must be firmly and consistently attached to the \nscalp. Even with these precautions, significant computational effort is needed to filter the resulting \nsignals effectively.",
      "caracteres": 3746
    },
    {
      "numero": 12,
      "texto": "Due to the complex, non-stationary, and nonlinear characteristics of EEG signals, several systems \nhave been developed for data analysis. Signal complexity can be reduced using fast algorithms, \nenabling machine learning methods to automatically classify certain mental disorders with high \naccuracy. Disorders such as depression and epilepsy could be diagnosed at the same time. However, \nEEG-based diagnosis has limitations: patients may not exhibit abnormal patterns consistently, and \nshort EEG recordings can miss critical events, leading to inaccurate results. While long-term \nmonitoring improves the detection of abnormalities, EEG signals are highly susceptible to external \ninterference, and detecting periods of inactivity remains challenging [27]. \n \nUsability and ergonomics are key factors that influence the adoption of these technologies. Sensors \nand devices can be uncomfortable during extended acquisition sessions, while complex interfaces \nand advanced technical requirements may limit their use in clinical or home environments. The \nportability of certain devices, such as brain imaging systems (fMRI or PET), is also constrained by \ntheir size and dependence on specialized infrastructure, restricting their application to research \ncenters or hospitals. Additionally, the high cost of advanced technologies constitutes a barrier to \ntheir widespread implementation. \n \nThe fNIRS faces challenges in distinguishing brain hemodynamic changes from artifacts caused by \nscalp hemodynamics or movement. Photons detected by infrared receivers are influenced by \nphysiological factors like respiration and heart rate, reducing contrast and spatial resolution. The \ntechnique also suffers from low temporal resolution and SNR [28]. Efforts to improve signal quality \nrange from averaging multiple readings to using advanced statistical models, but low sensitivity to \ndeeper brain layers and the inherent statistical properties of the signal complicate data \ninterpretation [29]. \n \nSome technologies are unsuitable for patients with metal implants or cognitive impairments. \nCombining these tools with conventional therapeutic approaches can be complex, particularly when \ndetermining the clinical relevance of the data collected. Ethical and privacy concerns related to brain \nand physiological data collection further complicate their adoption, necessitating stringent \nregulations to ensure user trust and safety. \n \nThe EEG technology has advanced with the development of wireless systems, dry electrodes, and \nAI-driven data processing. Dry electrodes enhance usability by enabling faster and more accessible \nsetups. While fNIRS is less affected by electromagnetic interference, its sensitivity is limited by the \nslower hemodynamic response compared to the rapid transmission of electrical signals in EEG. \nAI-enhanced multimodal fNIRS systems are approaching clinical-grade performance, although high \ncosts remain a significant barrier. \n \nThe term research-grade quality is often used to describe devices suitable for scientific studies but \nnot meeting the stringent standards required for clinical use. In contrast, low-cost EEG modules, \npriced under fifty dollars, offer affordable alternatives. Commonly sold as do-it-yourself (DIY) kits, \nthese modules allow for customized assembly, making EEG technology more accessible. While they \nlack the advanced features and precision of clinical-grade systems, they still provide meaningful \ninsights into brain activity. \n \nSoftware is often sold separately, significantly increasing overall costs. Commercial solutions typically \nstart around \\$1,000, with advanced versions reaching up to \\$8,000. Temporary licenses, renewable \nsubscriptions, and lite versions with limited functionality are common, while open-source platforms",
      "caracteres": 3811
    },
    {
      "numero": 13,
      "texto": "offer more accessible alternatives. Some systems are specifically designed for neurofeedback, with \nsoftware tailored to training games. Increasingly, brain monitoring devices integrate artificial \nintelligence (AI) for real-time data processing, anomaly detection, and rapid diagnostics. Open access \nto raw or AI-processed data fosters innovation and supports new research applications. Free access \nto AI-filtered data is a valuable resource for the neuroscience community. \n \nSeveral brain equipment manufacturers offer either complete systems or modular components, \nallowing for user customization, though often without clear guidance for selection. Some companies, \ntraditionally focused on wired systems, have introduced wireless options, typically limited to \namplifiers without caps. Others operate exclusively through rental or contracted services, while \ncertain technologies remain under development. Identified manufacturers include Compumedics \nNeuroscan (AUS), fNIR Devices (USA), Hitachi (JPN), Neurosoft (RUS), BioSemi (NLD), iCelera (BRA), \nContec (CHN), Meditron (BRA), Neurovirtual (USA), TechEn (USA), Imec (BEL), Kernel (USA), \nMindfield (DEU), NeuroPro (CHE), Gowerlabs (ENG), Neurotec (BRA), and Deymed (CZE). \nAdditionally, low-cost module providers include Deuteron (ISR) and Sichiray (CHN). In some cases, \nwebsites are outdated or provide little evidence of ongoing product availability, raising concerns \nabout whether some manufacturers are still active. \n \nConclusion \nThis review provides a comprehensive and technically grounded synthesis of the current landscape of \nnoninvasive brain monitoring technologies, with emphasis on their applicability to neuroscience and \nneurorehabilitation. By systematically mapping the specifications, architectures, and operational \nfeatures of commercially available EEG and fNIRS systems, the study translates complex engineering \ndata into an actionable framework for device selection and experimental design. The proposed \nframework supports researchers and clinicians in aligning technical parameters with the specific \ngoals of their investigations, facilitating evidence-based, reproducible, and methodologically sound \nuse of neurotechnological tools. \n \nThe analysis highlights that device selection should be guided primarily by the intended research or \nclinical objective. High temporal resolution and signal fidelity are essential for applications such as \nevent-related potentials and functional connectivity analysis, whereas mobility, ease of deployment, \nand rapid setup are critical for field studies, BCI applications, and rehabilitation in movement-rich \ncontexts. Multimodal configurations, such as integrated EEG–fNIRS systems, further expand the \npotential for real-time monitoring, neurofeedback, and closed-loop virtual reality paradigms. Across \nmodalities, core decision parameters include electrode or optode type, channel density, sampling \nrate, bit resolution, wireless transmission protocol, and data accessibility through standardized \ninterfaces or SDKs. \n \nPractical trade-offs also emerge among systems. Wet and gel-based electrodes provide the highest \nsignal quality but require time-intensive preparation, while dry and semi-dry electrodes enhance \nusability and participant comfort at the cost of slightly increased impedance. Channel configurations \nbetween 8 and 32 are suitable for most BCI and connectivity studies, whereas high-density arrays \n($\\ge$ 64 channels) enable source localization and advanced spatial analysis. Sampling rates between \n250 and 500 Hz meet the majority of experimental demands, while higher rates (\\SI{\\ge \n1}{\\kilo\\hertz}) and 24-bit resolution are recommended for precision time-locked paradigms. Reliable \nwireless connectivity—preferably low-latency Wi-Fi for data-intensive applications and Bluetooth \nLow Energy for mobile protocols—supports robust multimodal synchronization and integration with \nimmersive environments.",
      "caracteres": 3969
    },
    {
      "numero": 14,
      "texto": "In applied neurorehabilitation, integration with virtual reality systems requires ergonomically \noptimized, low-latency devices capable of sustaining high-quality signal acquisition during motion. \nSystems equipped with open SDKs and native synchronization libraries facilitate seamless \ncommunication with VR engines, enabling adaptive neurofeedback and ecological data capture. Dry \nelectrode designs are particularly advantageous in these contexts, improving participant comfort and \nreducing setup time while maintaining acceptable signal stability for most training and assessment \nscenarios. \n \nThe findings from the strong body of evidence in the scientific literature highlight a global movement \ntoward increasing the accessibility of neuroscience research through user-friendly, affordable, and \nwidely available devices, while also underscoring the persistent gap that remains between \nconsumer-grade and research-grade technologies. \n \nThe compiled dataset provides an evidence-based framework to guide neuroscientists, engineers, \nand clinicians in selecting the most appropriate device for their specific research needs. This work \nalso identifies critical technological trends, such as the strong convergence toward wireless \narchitectures and the growing emphasis on open data interfaces. \n \nOverall, this study contributes a reproducible, evidence-based technical mapping of EEG and fNIRS \ntechnologies, consolidating information from scientific, industrial, and patent sources into a unified \nclassification framework. Beyond informing device acquisition, these findings promote greater \ninteroperability, transparency, and standardization within the neurotechnology ecosystem. Future \nresearch should expand the evaluation scope to include longitudinal data quality, real-world \nreliability, and user experience metrics, strengthening the translational bridge between engineering \ninnovation and clinical neurorehabilitation. By doing so, the field moves closer to developing \nadaptive, accessible, and scientifically validated neurotechnological platforms capable of \ntransforming both neuroscience research and patient care. \n \nAcknowledgment \nThe authors acknowledge the support of CNPq and CAPES, whose continued commitment to \nscientific research, education, and innovation in Brazil made this work possible. \n \nBibliography \n1.​\nY. Duan, Z. Li, X. Tao, Q. Li, S. Hu, and J. Lu, “EEG-Based Maritime Object Detection for IoT-Driven Surveillance \nSystems in Smart Ocean,” IEEE Internet Things J., vol. 7, no. 10, pp. 9678–9687, Oct. 2020., doi:DOI: \n10.1109/JIOT.2020.2991025 \n2.​\nR. Zerafa, T. Camilleri, O. Falzon, and K. P. Camilleri, “A​ comparison of a broad range of EEG acquisition devices–is \nthere any difference for SSVEP BCIs” Brain Comput. Interfaces (Abingdon), vol. 5, no. 4, pp. 121–131, 2018., \ndoi:DOI: 10.1080/2326263X.2018.1550710 \n3.​\nK.-C. Chuang and Y.-P. Lin, “Cost-Efficient, Portable, and Custom Multi-Subject Electroencephalogram Recording \nSystem,” IEEE Access, vol. 7, pp. 56760–56769, 2019., doi:DOI: 10.1109/ACCESS.2019.2914088 \n4.​\nM. Doudou, A. Bouabdallah, and V. Berge-Cherfaoui, “Driver Drowsiness Measurement Technologies: Current \nResearch, Market Solutions, and Challenges,” International Journal of Intelligent Transportation Systems \nResearch, vol. 18, no. 2, pp. 297–319, 2020., doi:DOI: 10.1007/s13177-019-00199-w \n5.​\nG. Niso, E. Romero, J. T. Moreau, A. Araujo, and L. R. Krol, “Wireless EEG: A survey of systems and studies,” \nNeuroimage, vol. 269, p. 119774, Apr. 1 2023., doi:DOI: 10.1016/j.neuroimage.2022.119774",
      "caracteres": 3586
    },
    {
      "numero": 15,
      "texto": "6.​\nG. Aggarwal, X. Dai, R. Saatchi, R. Binns, and A. Sikandar, “Experimental demonstration of single-channel EEG \nsignal using 32 × 32 pixel OLED screen and camera,” Electronics (Basel), vol. 8, no. 7, p. 734, 2019., doi:DOI: \n10.3390/electronics8070734 \n7.​\nH. W. Huang, J. T. King, and C. L. Lee, “The New Science of Learning: Using the Power and Potential of the Brain to \nInform Digital Learning,” J. Educ. Technol. Soc., vol. 23, no. 4, pp. 1–13, 2020. \n8.​\nA. Grasso-Cladera, S. Costa-Cordella, A. Rossi, N. F. Fuchs, and F. J. Parada, “Mobile Brain/Body Imaging: \nChallenges and opportunities for the implementation of research programs based on the 4E perspective to \ncognition,” Adapt. Behav., vol. 31, no. 5, pp. 423–448, 2023., doi:DOI: 10.1177/10597123211072613 \n9.​\nC. He, Y. Y. Chen, C. R. Phang, C. Stevenson, I. P. Chen, T. P. Jung, et al., “Diversity and Suitability of the \nState-of-the-Art Wearable and Wireless EEG Systems Review,” IEEE J. Biomed. Health Inform., vol. 27, no. 8, pp. \n3830–3843, Aug. 2023., doi:DOI: 10.1109/JBHI.2023.3239053 \n10.​ E. Loizaga, A. T. Eyam, L. Bastida, and J. L. M. Lastra, “A Comprehensive Study of Human Factors, Sensory \nPrinciples, and Commercial Solutions for Future Human-Centered Working Operations in Industry 5.0,” IEEE \nAccess, vol. 11, pp. 53806–53829, 2023., doi:DOI: 10.1109/ACCESS.2023.3280071 \n11.​ J. Hernández-Capistrán, G. Alor-Hernández, H. Marín-Vega, M. Bustos-López, L. N. Sanchez-Morales, and J. L. \nSanchez-Cervantes, “Commercial Wearables for the Management of People with Autism Spectrum Disorder: A \nReview,” Biosensors (Basel), vol. 14, no. 11, p. 556, Nov. 15 2024., doi:DOI: 10.3390/bios14110556 \n12.​ D. Antolínez, A. Cisnal, V. Martínez-Cagigal, E. Santamaría-Vázquez, D. Benavides, J. Granja, et al., “Development \nand Validation of an Affordable Wearable Multichannel EEG System With Active Electrodes and Innovative \nFlexible Headbands,” IEEE Access, vol. 13, pp. 83983–83995, 2025., doi:DOI: 10.1109/ACCESS.2025.3568302 \n13.​ F. Minow, “Minimizing impedances and using the right electrolyte gel saves time and makes research more \neffective: a guidance from Falk Minow”, Brain Prod. Press Release, vol. 48, Oct. 2013, Access: May 2025. [Online]. \nhttps://www.easycap.de/wp-content/uploads/2018/02/ImpedancesElectrolytes.pdf \n14.​ H. Hinrichs, M. Scholz, A. K. Baum, J. W. Y. Kam, R. T. Knight, and H.-J. Heinze, “Comparison between a wireless dry \nelectrode EEG system with a conventional wired wet electrode EEG system for clinical applications,” Sci. Rep., vol. \n10, no. 1, p. 5218, Mar. 23 2020., doi:DOI: 10.1038/s41598-020-62154-0 \n15.​ D. Liley and L. Kuhlmann, “Comparison of waveguard touch dry electrodes to conventional gelled electrodes on \nphysiological \nparadigms”. \nAccess: \nMay \n2025. \n[Online]. \nhttps://www.ant-neuro.com/blog/showcases-1/comparison-of-waveguard-touch-dry-electrodes-to-conventional-\ngelled-electrodes-on-physiological-paradigms-62\\#blog\\_content. \n16.​ V. Nathan and R. Jafari, “Design Principles and Dynamic Front End Reconfiguration for Low Noise EEG Acquisition \nWith Finger Based Dry Electrodes,” IEEE Trans. Biomed. Circuits Syst., vol. 9, no. 5, pp. 631–640, Oct. 2015., \ndoi:DOI: 10.1109/TBCAS.2015.2471080 \n17.​ I. F. Warsito, M. Komosar, M. A. Bernhard, P. Fiedler, and J. Haueisen, “Flower electrodes for comfortable dry \nelectroencephalography,” Sci. Rep., vol. 13, no. 1, p. 16589, Oct. 3 2023., doi:DOI: 10.1038/s41598-023-42732-8 \n18.​ P. Tallgren, S. Vanhatalo, K. Kaila, and J. Voipio, “Evaluation of commercially available electrodes and gels for \nrecording of slow EEG potentials,” Clin. Neurophysiol., vol. 116, no. 4, pp. 799–806, Apr. 2005., doi:DOI: \n10.1016/j.clinph.2004.10.001 \n19.​ I. Rakhmatulin, “Low-Cost Shield ardEEG to Measure EEG with Arduino Uno R4 WiFi”, May 2024. DOI: \n10.20944/preprints202405.1643.v1. \n20.​ D. S. Kumar, et al., “A high CMRR analog front-end IC for wearable physiological monitoring”, in 2012 Annual IEEE \nIndia Conference (INDICON), Kochi: IEEE, Dec 2012, p. 385–388. DOI: 10.1109/INDCON.2012.6420648. \n21.​ S. Iwama, M. Takemi, R. Eguchi, R. Hirose, M. Morishige, and J. Ushiba, “Two common issues in synchronized \nmultimodal recordings with EEG: Jitter and latency,” Neurosci. Res., vol. 203, pp. 1–7, Jun. 2024., doi:DOI: \n10.1016/j.neures.2023.12.003 \n22.​ M. Serra-Sala, C. Timoneda-Gallart, and F. Pérez-Álvarez, “Clinical usefulness of hemoencephalography beyond the \nneurofeedback,” Neuropsychiatr. Dis. Treat., vol. 12, May, pp. 1173–1180, May 11 2016., doi:DOI: \n10.2147/NDT.S105476 \n23.​ A. A. Bisu, A. Purvis, K. Brigham, and H. Sun, “A Framework for End-to-End Latency Measurements in a Satellite \nNetwork Environment”, em 2018 IEEE International Conference on Communications (ICC), Kansas City, MO: IEEE, \nMay 2018, p. 1–6. DOI: 10.1109/ICC.2018.8422913.",
      "caracteres": 4849
    },
    {
      "numero": 16,
      "texto": "24.​ F. Klassen and R. Silverman, “System and method for analyzing and tuning a communications network”, \nUS6711137B1, 1999 Access: Jun 2025. [Online] https://patents.google.com/patent/US6711137B1/en \n25.​ B. Sawant, “Latency and Throughput Optimization In Modern Networks,” Int. J. Adv. Res. Sci. Commun. Technol., \nMay, pp. 585–592, 2021., doi:DOI: 10.48175/IJARSCT-1298 \n26.​ J.-P. Stauffert, F. Niebling, and M. E. Latoschik, “Reducing application-stage latencies for real-time interactive \nsystems”, in 2016 IEEE 9th Workshop on Software Engineering and Architectures for Realtime Interactive \nSystems (SEARIS), Greenville, SC, USA: IEEE, Mar 2016, p. 1–7. DOI: 10.1109/SEARIS.2016.7551584. \n27.​ Y. Zheng, C. Liu, N. Y. G. Lai, Q. Wang, Q. Xia, X. Sun, et al., “Current development of biosensing technologies \ntowards diagnosis of mental diseases,” Front. Bioeng. Biotechnol., vol. 11, p. 1190211, Jun. 29 2023., doi:DOI: \n10.3389/fbioe.2023.1190211 \n28.​ R. Li, D. Yang, F. Fang, K.-S. Hong, A. L. Reiss, and Y. Zhang, “Concurrent fNIRS and EEG for Brain Function \nInvestigation: A Systematic, Methodology-Focused Review,” Sensors (Basel), vol. 22, no. 15, p. 5865, Aug. 5 2022., \ndoi:DOI: 10.3390/s22155865 \n29.​ C. T. Baker, “Documenting the Effects of Noninvasive Prefrontal pIR HEG Neurofeedback in the Treatment of \nCommon Mental Health Problems”, NeuroRegulation, vol. 10, no 3, p. 207–218, Set 2023, DOI: \n10.15540/nr.10.3.207. \n30.​ K.-C. Chuang and Y.-P. Lin, “Cost-Efficient, Portable, and Custom Multi-Subject Electroencephalogram Recording \nSystem,” IEEE Access, vol. 7, pp. 56760–56769, 2019, doi: 10.1109/ACCESS.2019.2914088. \n31.​ M. Doudou, A. Bouabdallah, and V. Berge-Cherfaoui, “Driver Drowsiness Measurement Technologies: Current \nResearch, Market Solutions, and Challenges,” International Journal of Intelligent Transportation Systems \nResearch, vol. 18, no. 2, pp. 297–319, 2020, doi: 10.1007/s13177-019-00199-w.",
      "caracteres": 1943
    }
  ],
  "texto_completo": "Brain Monitoring Devices for Neuroscience: A Review of Current Technologies \ndoi: 10.1109/ACCESS.2024.0429000 \n \nThis work was supported by the National Council for Scientific and Technological Development \n(CNPq), Brazil, under Grant 443965/2024-2, and by the Coordination for the Improvement of Higher \nEducation Personnel (CAPES), Brazil, Finance Code 2143671. \n \nAbstract \nThis scoping review provides a technical characterization of 96 wireless brain monitoring devices \n(EEG and fNIRS), totaling 125 models and variants, currently available on the global market. A \nscientific characterization was performed by systematically searching the literature following \nPRISMA guidelines and registered in the OSF. The search was conducted across five databases (IEEE, \nScopus, PubMed, Web of Science, and Embase) to identify the applications of the devices tracked in \nthe market. The searches were conducted between January and August 2025. A total of 5,071 \nrecords were analyzed; 3,741 were unique entries. Among these, 2,087 studies explicitly reported \nthe use of brain devices in clinical trials, dataset development, or technology evaluations, with an \noverall inclusion rate of 55.79\\% after screening. Research adoption was quantified by the number of \nDOI-indexed publications referencing each device. The Epoc X leads the number of research \npublications with 19.30\\%, followed by the OpenBCI system with 4.81\\%, and the MindWave with \n4.06\\%. Enobio appears in fourth place with 2.89\\% and g.Nautilus ranks eighth with 1.71\\%. These \nfindings demonstrate a global effort by researchers to conduct accessible studies using user-friendly, \nlow-cost, and widely available devices, revealing a significant gap between consumer-grade and \nresearch-grade technologies. The compiled dataset provides an evidence-based framework to guide \nneuroscientists, engineers, and clinicians in selecting the appropriate device for their specific \nresearch needs. This work also identifies critical trends, such as the strong convergence toward \nwireless architectures and the growing emphasis on open data interfaces. \n \nKeywords \nBiomedical Instrumentation, Brain-Computer Interfaces, Electroencephalography (EEG), Functional \nNear-Infrared Spectroscopy (fNIRS), Wireless Neurotechnology. \n \nIntroduction \nAdvances in neurotechnology have profoundly transformed the field of neurorehabilitation, enabling \ntargeted stimulation of neuroplasticity, data-driven clinical decision-making, and continuous \nmonitoring of brain activity in both laboratory and real-world settings. These systems integrate \nsensor-based monitoring, signal processing, and computational modeling to generate objective \nindicators of brain function, enhancing the precision, reproducibility, and personalization of \ntherapeutic interventions. The emergence of portable, wireless, and cost-effective brain monitoring \ndevices has further democratized access to neuroscience tools, allowing the acquisition of \nhigh-quality neural data under ecologically valid and movement-rich conditions that better reflect \nfunctional behavior in daily life. \n \nAmong noninvasive neuroimaging modalities, electroencephalography (EEG) and functional \nnear-infrared spectroscopy (fNIRS) have become fundamental in both clinical and experimental \nneuroscience. EEG records electrical potentials with high temporal resolution, providing direct \ninsight into neuronal dynamics and oscillatory activity. Its portability, affordability, and compatibility \nwith wearable architectures make it particularly suitable for neurofeedback and brain–computer \ninterface (BCI) applications. In contrast, fNIRS measures hemodynamic changes associated with\n\ncortical activation by detecting oxygenation-dependent absorption of near-infrared light. Although it \nprovides lower temporal resolution than EEG, fNIRS achieves higher spatial location and greater \nrobustness against electrical interference. When combined, EEG and fNIRS offer complementary \ninformation—temporal precision and hemodynamic specificity—creating multimodal platforms \ncapable of characterizing the neural mechanisms underlying movement, learning, and recovery. \n \nIn neurorehabilitation, these multimodal monitoring systems enable quantification of functional \nrecovery and optimization of individualized therapy programs. They support closed-loop \nneurofeedback by providing brain-derived real-time metrics that guide adaptive training and \npromote cortical reorganization after neurological injury. When embedded in immersive or gamified \nenvironments, such systems enhance engagement and motivation, bridging neuroscience and \nrehabilitation engineering. The resulting datasets not only inform clinical decisions but also \ncontribute to large-scale neurophysiological research through standardized and reproducible \nacquisition protocols. \n \nDespite their growing potential, selecting the most appropriate brain monitoring device remains a \nmajor challenge. The commercial landscape has expanded rapidly, encompassing numerous \nmanufacturers and models with heterogeneous technical specifications, including differences in \nsignal quality, channel count, electrode or optode design, wireless architecture, data accessibility, and \nintegration capabilities. This diversity, coupled with the absence of standardized technical reporting, \nhinders direct comparison between systems and complicates the alignment of device performance \nwith specific experimental or therapeutic goals. As a result, decision-making often becomes complex \nand time-consuming, resembling the paradox of choice, where an excess of alternatives may obscure \noptimal selection. \n \nTo address this gap, the present work goes beyond existing wireless EEG and multimodal \nneurotechnology surveys by providing a large-scale, device-level mapping and technical \ncharacterization of commercially available EEG and fNIRS systems relevant to neuroscience and \nneurorehabilitation research. Unlike prior reviews that focus primarily on signal processing methods, \nexperimental paradigms, or small subsets of devices, this study systematically analyzes 96 \ncommercially available systems using manufacturer documentation, technical manuals, patents, and \nsecondary literature. The resulting framework integrates engineering specifications with \napplication-oriented criteria, including connectivity, data access, synchronization support, and \nproxy-based closed-loop readiness, as well as bibliometric indicators of device adoption in the \nliterature. By combining technical, applicational, and adoption-level perspectives, this review offers a \ntranslationally oriented resource that is not available in existing surveys. \n \nBy integrating these dimensions, this review offers a decision-support framework to guide scientists, \nengineers, and clinicians in selecting brain monitoring technologies that are best suited to their \nmethodological and operational requirements. Ultimately, its goal is to strengthen the interface \nbetween biomedical engineering and clinical neuroscience, accelerating the translation of portable \nbrain monitoring systems into real-world neurorehabilitation contexts and advancing the \ndevelopment of evidence-based neurotechnological practice. \n \nBackground \nSeveral studies have directly addressed the scope of this work, providing relevant findings and \ninsights. According to [1], EEG remains a preferred modality in neuroscience and BCI research due to \nits widespread familiarity and high temporal resolution, which makes it particularly suitable for\n\napplications such as mental state classification, motor imagery, brain–computer interfaces, robotic \ncontrol, and neuroadaptive games.  \n \nReference [2] conducted a standardized comparison of six EEG systems, isolating signal quality from \nclassifier performance. The active gel-based system achieved the highest signal-to-noise ratio (SNR), \nfollowed by a passive gel system, while other passive and dry electrode systems exhibited reduced \nperformance because of design and contact limitations. The Saline-based electrodes showed the \nlowest signal quality. Despite lower SNR, wireless and dry systems are often favored in short-term or \nuser-oriented contexts for their comfort and usability. For clinical or high-performance BCI \napplications, high-end systems remain the most reliable, though mid-range commercial devices may \noffer a cost-effective balance of signal quality and operational flexibility.  \n \nA study summarizes general technical specifications for six EEG devices and notes that several \nstudies have empirically evaluated the effectiveness of these wearable neurotechnologies in \nfundamental research and BCI applications [3]. Reference [4] presents a comprehensive review of \ndriver drowsiness detection systems, examining 24 EEG-based technologies that use physiological \nbrain signals to determine drowsiness and wakefulness.   \n \nAn overview of wireless EEG hardware is provided by [5]. This comprehensive survey includes 48 \nwireless EEG devices, outlining key features and specifications to enable side-by-side comparisons \nand support informed hardware selection. Additionally, it reviews 110 publications that employed \nwireless EEG, categorizing them by application and analyzing factors such as the devices used, \nnumber of channels, sample sizes, and participant mobility. Complementing this analysis, the paper \nprovides background information and critical commentary on the challenges and considerations \ninherent to wireless EEG research, offering valuable insights.  \n \nAs noted by [6], BCIs enable brain–device communication, typically via EEG. Common systems range \nfrom single-channel dry electrodes for targeted monitoring to saline-based devices offering broader \nfunctionality. Lightweight multichannel setups are preferred for comprehensive recordings, while \nheadband-style devices are often used in gaming and sleep assessments. Dry electrodes are generally \nfavored over wet ones due to reduced setup time and improved comfort. Device selection depends on \nthe application and critical parameters such as sampling rate, resolution, battery life, and electrode \ncount.  \n \nEEG devices are commonly categorized based on a combination of intended use, technical \nspecifications, signal quality, and regulatory status, rather than a single criterion such as price or \nchannel count. Consumer-grade EEG systems are generally low-cost, portable, and easy to deploy, \nand are primarily marketed for non-clinical applications such as neurofeedback, gaming, wellness, \nand exploratory experimentation. These systems typically feature a limited number of channels, \nprioritize usability and comfort, and often employ dry or semi-dry electrodes, which may constrain \nsignal robustness. Research-grade EEG systems are designed for academic and laboratory use and \nprovide higher channel counts, improved signal-to-noise ratio, flexible acquisition parameters, and \nfull access to raw data, supporting rigorous experimental protocols. Clinical-grade (or medical-grade) \nEEG systems are certified for diagnostic and clinical applications and must comply with stringent \nregulatory standards for safety, reliability, and performance, including formal medical device \napproval. Overall, this classification reflects increasing levels of data quality, experimental control, \nand regulatory compliance across consumer, research, and clinical contexts [Chuang and Lin, 2019], \n[Doudou et al., 2020].\n\nAccording to [7], wet-electrode EEG systems classified as research-grade or clinical-grade typically \ncomprise 32 to 256 channels, cost tens of thousands of dollars, and offer high signal stability suitable \nfor advanced analyses in controlled laboratory or clinical environments. However, these systems \nrequire trained personnel, setup times of approximately 15–30 minutes, and post-recording hair \nwashing, which limits their usability outside laboratory settings. Despite these constraints, they \nprovide scalable architectures and reliable access to raw signals, although the availability of \nembedded algorithms is often limited. In contrast, dry-electrode EEG systems, commonly associated \nwith consumer-grade and some research-grade devices, are generally priced under a few thousand \ndollars, support 1 to 64 channels, and allow rapid setup (typically under 10 minutes) without the need \nfor hair washing. These systems offer higher user comfort and wireless operation, enabling mobile \nand hyperscanning recordings, but may exhibit greater variability in signal stability. \n \nFrom a signal quality perspective, consumer-grade EEG systems tend to perform adequately under \nhigh signal-to-noise ratio (SNR) conditions, such as event-related potential (ERP) paradigms \nconducted in controlled environments. However, their performance often degrades in real-world, \nlow-SNR scenarios, particularly in mobile or naturalistic settings. Empirical evaluations indicate that \nresearch-grade systems, especially those with higher sensor density, yield more reliable and \nreproducible data under such conditions. These findings suggest that, despite their practical \nadvantages, consumer-grade devices may be insufficient for studies requiring robust signal quality in \necological environments, underscoring the need for further advancements in dry-electrode \ntechnology to bridge this gap [8]. \n \nReference [9] conducted a large-scale review of the technical specifications of 16 wireless EEG \nsystems from multiple manufacturers. The study shows a comparative analysis of key features, \nunderscoring the increasing accessibility and formal classification of wireless EEG technologies. \n \nAnother study [10] presents a table of 31 devices focused on measuring brain activity related to the \ncentral nervous system, highlighting key market players and their most representative products. \nReference [11] classifies 22 brain monitoring devices based on their primary applications: executive \nfunction, psychomotor skills, and behavioral, emotional, and sensory domains. Study selection and \nanalysis were systematically conducted following the PRISMA-ScR framework.  \n \nReference [12] reports the development of a low-cost EEG system and compares commercial devices \nranging from USD 300 to 50,000. High-end prices reflect regulatory certifications required for \nclinical use, which are often unnecessary for non-clinical BCIs. The limited availability of affordable, \nhigh-quality options leads researchers to rely on costly clinical-grade systems. As costs scale with \nchannel count, reducing electrode number and optimizing spatial placement can improve \ncost-efficiency without compromising performance.  \n \nPassive EEG electrodes transmit signals directly to the amplifier, while active electrodes incorporate \na preamplifier. Reliable recordings require stable electrode–scalp contact, shielding against \nelectromagnetic interference, and consistent signal acquisition. Improved contact enhances noise \nidentification and data reliability, potentially reducing the required sample size (n). Skin impedance \ndecreases from \\SI{\\sim200}{\\kilo\\ohm} (uncleaned) to \\SI{\\sim120}{\\kilo\\ohm} (cleaned), with \nfurther reduction achievable through exfoliation or alcohol application at the electrode site [13].  \n \nWet EEG electrodes with gel provide low impedance (\\SI{<10}{\\kilo\\ohm}) but require skin \npreparation, electrolyte application, and cleaning. Signal quality declines as the gel dries, limiting its \nsuitability for non-clinical use. Saline-based electrodes offer an alternative but may irritate abraded\n\nskin and promote oxidation, reducing lifespan [13], [14]. Dry electrodes enable faster setup; although \nimpedance is higher, advanced algorithms reduce noise and artifacts. Well-designed dry systems \ncombining optimized materials, placement, and shielding can achieve signal quality comparable to \nwet systems [14], [15], [16], [17]. Silver electrodes coated with silver chloride (Ag/AgCl) remain the \ngold standard due to their corrosion resistance [18].  \n \nFurthermore, low-cost EEG modules, typically compatible with open-source development platforms, \nhave emerged as accessible alternatives for initial investigations, educational purposes, and \nnon-clinical research. However, their limited functionality and susceptibility to noise constrain their \nuse in high-precision applications [19].  \n \nThe common-mode rejection ratio (CMRR) of driven right leg (DRL) circuits is essential for minimizing \ncommon-mode noise in biopotential recordings. DRL systems operate by inverting the \ncommon-mode voltage, detected via a common-mode sense (CMS) electrode, and feeding it back to \nthe participant through the DRL electrode. This negative feedback reduces interference at the \namplifier inputs, enhancing CMRR and signal fidelity. Combined, CMS and DRL improve noise \nrejection and overall recording reliability [20].  \n \nThe lab streaming layer (LSL) enables precise multimodal synchronization without hardware triggers, \nsupporting seamless integration with platforms such as MATLAB, Python, OpenViBE, BCI2000, and \nUnity. It synchronizes EEG, video, peripheral sensors, and stimulus markers for real-time applications, \nenhancing interoperability and scalability in research [21].  \n \nThe fNIRS measures cortical oxygenation and blood flow up to \\SI{\\sim15}{\\milli\\metre} depth using \nred and near-infrared light. Emitted light penetrates the scalp and skull, interacts with brain tissue, \nand is detected by infrared sensors positioned a few centimeters away. Absorption patterns, \ninfluenced by changes in hemoglobin saturation, allow inference of cortical activity. Red light is \nprimarily absorbed by oxygenated hemoglobin, while near-infrared light reflects total blood \nconcentration. Short source–detector separations minimize contamination from superficial tissues, \nenhancing signal specificity [22].  \n \nLatency, response time, jitter, and throughput are key performance metrics in wireless EEG and fNIRS \nsystems, influencing reliability and real-time operation. Latency is the delay from neural or \nhemodynamic activity to its digitized signal; response time adds processing delays. Jitter, or \nvariability in these times, reduces temporal precision, while throughput, the rate of successful data \ntransmission, often trades off with latency. Optimizing these metrics is essential for temporal \nresolution, data integrity, and real-time responsiveness [23], [24], [25], [26]. \n \nBrain \nmonitoring \ndevices \nincreasingly \nintegrate \nmultimodal \nbiosensors, \nincluding \nelectrocardiography (ECG), photoplethysmography (PPG), pulse oximetry, and blood pressure for \ncardiovascular \nmonitoring; \nelectromyography \n(EMG) \nand \nelectrooculography \n(EOG) \nfor \nneuromuscular and ocular activity; and inertial measurement units (IMU), respiration sensors, and \nballistocardiography (BCG) for motion and breathing. Galvanic skin response (GSR) and thermal \nsensors track skin conductance and temperature, while some systems add eye tracking and \nlight-based neuromodulation, such as transcranial photobiomodulation (tPBM) and near-infrared \nphotobiomodulation (NIR-PBM).\n\nMethod \nThis scoping review employed a structured documentary approach to identify and characterize \ncommercially available brain-monitoring devices. Data were collected from both primary scientific \nliterature and secondary sources, including patents, user manuals, and manufacturer websites. \nDevices were included based on the following criteria: (i) noninvasive neurotechnologies; (ii) portable \nform factor suitable for clinical or field use; (iii) commercial availability in the global market; (iv) sold \nas complete bundled systems rather than modular components; and (v) demonstrated or potential \nrelevance to neuroscience and neurorehabilitation applications.  \n \nTo define the technological scope of the review, MeSH categories were consulted. “Diagnostic \nTechniques and Procedures” was selected as the overarching classification encompassing \nbrain-monitoring modalities across the target databases. Identified technologies included EEG, HEG, \nNIRS, fNIRS, PET, MEG, MRI, and fMRI. However, the final analysis focused exclusively on \nnoninvasive, portable, and wireless EEG and fNIRS devices.  \n \nDatabase searches were conducted from March to August 2025 across five platforms: IEEE Xplore, \nPubMed/MEDLINE, Web of Science, Scopus, and Embase. Each search employed a Boolean query \ncombining device name, manufacturer, and technology terms (e.g., “device” AND “manufacturer” \nAND “EEG/fNIRS”). Queries were adapted to the syntax and indexing structure of each database. \nIEEE Xplore was used for engineering and hardware design; PubMed/MEDLINE for its coverage of \nbiomedical literature; Web of Science and Scopus for multidisciplinary indexing and citation tracking; \nand Embase for its emphasis on medical devices and international content.  \n \nAn inclusion rate was used as a measure of search efficiency for each device-specific query. All \nretrieved records were screened to determine whether the named brain device was effectively \napplied as an experimental or clinical tool in the study; records in which the device name referred to \nan unrelated entity (e.g., personal names or acronyms with different meanings) or in which the device \nwas merely mentioned without actual use were excluded. The inclusion rate was defined as the \nproportion of retrieved records that met the inclusion criterion of explicit device application, \ncalculated as: \nInclusion rate = \nNumber of included studies using the device \nTotal number of records retrieved for that device \n \nThis metric reflects the precision of the device-specific search strategy, rather than sensitivity or \nrecall, and was used to quantify the effectiveness of each query in identifying studies with confirmed \ndevice usage. \n \nThe number of DOI-indexed publications referencing each identified device was recorded to assess \nresearch use. No language or date restrictions were applied. \n \nA summary table was compiled for all eligible devices, including technical parameters such as the \nnumber of channels, electrode type, sampling rate, data connectivity, software availability, and \nintended application. Additionally, peer-reviewed articles reporting experimental or clinical use of \neach device were identified to verify relevance, deployment, and impact across neuroscience and \nbiomedical engineering domains.  \n \nThe protocol of this scoping review was prospectively registered in the Open Science Framework \n(OSF) under the registration DOI: 10.17605/OSF.IO/EMRH8.\n\nResults \nA total of 5,071 records were retrieved from the selected scientific databases based on the inclusion \ncriteria. After removing 1,331 duplicates (26.25\\%), 3,741 unique records remained. Of these, 2,087 \nstudies explicitly reported the use of brain monitoring devices in clinical trials, dataset development, \nor technological assessments, yielding an inclusion rate of 55.79\\% after title, abstract, and full-text \nscreening. Eighty records (2.14\\%) were excluded due to a lack of access. Supplementary technical \ninformation was obtained from manufacturers’ websites and consolidated in Table 1, comprising 96 \ndevices, 125 when including model variants. Research adoption was quantified by the number of \nDOI-indexed publications referencing each device. No critical appraisal of individual sources of \nevidence was performed, as this scoping review aimed to map the extent and nature of the literature \nwithout assessing study quality.  \n \nTable 1. Portable and Wireless Brain Monitoring Devices (2025 Worldwide Commercial Availability) \n \nFootnote. Closed-loop readiness represents a proxy-based classification of device suitability for \nreal-time and closed-loop applications. This indicator is inferred from transmission-related\n\nspecifications, including wireless communication protocol, channel count, nominal sampling rate, and \ndata access capabilities. It does not reflect experimentally measured latency or jitter, nor does it \nimply regulatory certification or guaranteed real-time performance. \n \nTable Description \nTable 1 summarizes the technical, functional, and bibliometric characteristics of the EEG devices \nidentified in this scoping review. The table reports the monitoring technology and commercial model, \ntogether with the device type, usage grade, manufacturer, and country of origin. The grade column \nclassifies devices as consumer-grade, research-grade, or clinical-grade according to their intended \nuse, technical capabilities, and regulatory context, providing a high-level distinction between \nwellness-oriented, research-focused, and clinically certified systems. \n \nSensor-related information includes electrode type and sensor technology, reflecting conductive \nmedia requirements, signal acquisition principles, and factors affecting signal quality, noise \nsusceptibility, and user comfort. Hardware configuration is described by the number of recording \nchannels and electrode positioning, while wireless connectivity specifies the communication \ntechnology used for data transmission. \n \nParameters relevant to data acquisition include the nominal sampling rate and analog-to-digital \nconverter (ADC) resolution. Raw data access indicates whether unprocessed EEG signals are \navailable to the user. Closed-loop readiness provides a proxy-based classification of device suitability \nfor real-time and closed-loop applications, categorized as Low, Medium, or High, and inferred from \ntransmission-related specifications, including wireless communication protocol, channel count, and \nnominal sampling rate. This classification supports a comparative assessment of real-time \ntransmission constraints and performance trade-offs, without implying regulatory certification, \nexperimentally validated latency or jitter, or guaranteed real-time performance. These proxy \nparameters reflect timing and bandwidth constraints relevant to closed-loop applications, such as \nreal-time neurofeedback, adaptive BCI control, and event-locked multimodal synchronization. \n \nSoftware-related aspects are reported through bundled software and data synchronization. Bundled \nsoftware describes the availability and licensing model of manufacturer-provided software for data \nacquisition, control, or visualization, including desktop, mobile, web-based, or cloud applications, \nwhether included, freely available, open-source, subscription-based, or sold separately. Data \nsynchronization indicates the availability of software interfaces and communication protocols, such \nas SDKs, APIs, LSL, or TCP, that enable event-based and temporal alignment of EEG data streams with \nexternal systems or multimodal sources. Auxiliary capabilities summarize additional integrated \nfunctionalities, such as inertial sensors or embedded analytics. \n \nFinally, price information, when available, is reported in U.S. dollars, excluding taxes and shipping, \nwith currency conversion applied as needed; in cases where prices were not publicly disclosed, \nmanufacturers were contacted, although such values are not shown to account for confidentiality \nand variability in purchasing terms. The bibliometric columns report the number of peer-reviewed \nstudies using each device and the corresponding inclusion proportion, representing the share of \nincluded records in which the device was explicitly applied. \n \nDevice design varies substantially across categories. Caps streamline setup, enhance sensor contact, \nand optimize signal quality. Headsets, resembling headphones, combine ease of use with safety, \nmaking them suitable for immersive clinical and non-clinical scenarios. Headbands provide\n\nlightweight, ergonomic form factors ideal for cognitive research, neurofeedback, and brain-computer \ninterfaces (BCI) in naturalistic environments. Earphones and headphones integrate auditory \nstimulation with EEG acquisition, while adhesive systems enable low-impedance, long-duration \nrecordings, useful in intensive care unit (ICU) and sleep studies. The fNIRS caps and headsets offer \nspatial mapping of cortical activity and are used in complex cognitive and motor studies. Multimodal \ndevices, including those integrating EEG with fNIRS, enhance spatial and temporal resolution, \nsupporting applications such as virtual reality (VR)-based neurorehabilitation. \n \nDiscussion of Results \nThis review focuses on device-level technical specifications, reported capabilities, and usage patterns \nacross the literature, rather than on experimental validation of signal quality or performance \nbenchmarking under controlled conditions. As validation protocols, signal-to-noise ratios, and \ncomparative performance metrics are highly task-, setup-, and population-dependent and are \ninconsistently reported across studies, a quantitative cross-device evaluation of signal quality was \nconsidered outside the scope of this scoping review. Instead, performance trade-offs between \ndevices were examined at an architectural and applicational level, considering factors such as channel \ncount, electrode technology, wireless communication protocol, data access, and software integration. \n \nThe 125 devices identified in this work span an impressive range of channel counts, from \nultra-compact single-channel units designed for basic biofeedback to full 150-channel \nresearch-grade rigs. Counts in the studies found column indicate not only device popularity but also \nempirical maturity, reflecting the availability of reliable estimates for signal-to-noise ratio (SNR), \nnoise spectral profiles, dropout rates, and operational parameters such as typical impedance, setup \ntime, and gain/analog-to-digital converter (ADC) stability. Devices with extensive literature typically \nexhibit well-characterized sensor geometries and analog front-ends, enabling informed technical \ndecisions on montage, preprocessing (bandpass, notch, referencing), artifact modeling (ICA \ntemplates, motion regression), and synchronization requirements for ERP or closed-loop paradigms. \nHowever, a high publication count does not eliminate methodological risks: firmware or driver \nupdates, raw data access policies, and reliance on proprietary pipelines may introduce systematic \nbiases and affect inter-site reproducibility. These factors require authors to report the firmware \nversion and exact acquisition conditions.  \n \nSome models are frequently cited (often due to accessibility and cost), while others show few or no \nreported applications, indicating a lack of independent validation. For studies requiring statistical \nrobustness and reproducibility (e.g., clinical ERP, connectivity analyses), selecting devices with \nsubstantial prior use reduces measurement bias risk. In exploratory or prototyping contexts, devices \nwith limited publications may still be valuable if accompanied by technical validation (pilot SNR, \ndropout, latency) and explicit discussion of generalization limits, as low study counts may reflect \nnovelty or barriers such as cost, licensing, or raw data availability.  \n \nSampling rates across these devices reflect their intended applications. Consumer-grade and \nlow-power BCI headsets often operate at 86–250 Hz, sufficient for basic cognitive and affective \nstudies. Most research-oriented systems, however, sample between 250 Hz and 1 kHz, supporting \nstandard ERP, spectral, and time–frequency analyses without aliasing. A few multimodal platforms \npush sampling rates up to 16 kHz to capture high-frequency EEG or evoked potentials with \nmillisecond precision, though this comes with increased demands for data storage and transmission.\n\nBit depth is another critical differentiator. Lower-cost units typically employ 12–14-bit ADCs, \nadequate for classroom demonstrations or basic neurofeedback. Mid-tier research systems almost \nuniversally provide 16-bit resolution, offering a robust SNR for most experimental paradigms. \nPremium devices feature 24-bit or even 32-bit converters, minimizing quantization noise and \nmaximizing dynamic range for detecting subtle oscillatory phenomena or conducting source \nlocalization.  \n \nConnectivity options mirror trade-offs between mobility and data throughput. Bluetooth dominates \nthe entry and mid-range segments, enabling wireless operation at sampling rates up to 1 kHz with \nlatencies suitable for BCI control or ambulatory monitoring. A smaller subset of systems supports \nWi-Fi streaming, which is essential for multi-subject experiments (hyperscanning). \n \nThis scoping review focuses on device-level technical specifications and adoption patterns reported \nin the literature, rather than on clinical validation or experimental benchmarking of signal quality. \n \nLatency, jitter, and throughput were not reported as device-specific numerical values, as these \nmetrics are rarely disclosed by manufacturers and are highly configuration-dependent. In this review, \nthese parameters are therefore treated as application-level performance criteria, rather than \nexperimental measurements, and were integrated into the comparative framework using protocol- \nand data-rate–based proxies. Throughput requirements were inferred from channel count and \nnominal sampling rate, while latency and jitter were contextualized according to the wireless \ncommunication protocol. In this context, quantitative integration refers to the use of minimum \ndata-rate requirements and protocol-level constraints as comparative proxies, rather than to \nexperimentally measured latency or jitter values. \n \nSoftware support is a major consideration beyond hardware specifications. Approximately 70–80\\% \nof devices include their own acquisition and visualization suites; more advanced systems supplement \nthis with Python, MATLAB, or LabVIEW SDKs, enabling custom preprocessing, real-time artifact \nrejection, and precise synchronization with stimuli or other biosignals. Entry-level headsets may only \npermit audio-based triggers or manual markers, adequate for broad cognitive tasks but insufficient \nfor high-precision studies or closed-loop neuromodulation. \n \nBased on a renowned manufacturer whose devices are widely recognized in research, the cost of EEG \nsystems varies significantly with the number of channels, which directly affects spatial resolution and \nthe range of clinical or research applications. Lower-channel systems, such as 8-channel devices, are \npriced around \\$6,000 (USD), making them suitable for basic monitoring tasks, educational use, or \npreliminary research. As channel count increases, so does the system’s complexity and capabilities, \nresulting in higher costs. For instance, a 16-channel EEG device is priced at approximately \\$14,000, \nwhile a 32-channel system costs about \\$24,000. High-density EEG systems with 64 channels offer \nsuperior spatial resolution and advanced signal acquisition but are substantially more expensive, \noften exceeding \\$50,000. These price differences highlight the trade-offs between cost, signal \nquality, and application scope, underscoring the importance of selecting a system that aligns with the \nproject's specific needs and budgetary constraints. \n \nRegarding devices with electrode caps, the choice of base material is critical. Densely woven meshes \nand thick fabrics, such as neoprene, may cause discomfort due to increased scalp pressure and heat \nretention, given the head’s sensitivity to temperature variations. Excessive or uneven pressure can \ndegrade signal quality by affecting the electrode–skin interface, increasing impedance, and \nintroducing motion artifacts. Furthermore, sustained pressure may lead to thermal discomfort and\n\nsweating, which can further impair conductivity. Asymmetrical pressure distribution may also \nintroduce artificial asymmetries in the recorded data. Consequently, device design must prioritize \nergonomic fit and material selection to ensure user comfort while preserving signal integrity and data \nreliability. \n \nThe “Epoc X” device by Emotiv leads the number of research publications with 19.30\\%, followed by \nthe OpenBCI system with 4.81\\%, and the “MindWave Mobile 2” by Neurosky with 4.06\\%. All three \nare consumer-grade models. In fourth place appears the first research-grade device, the Enobio by \nNeuroelectrics, with 2.89\\%. The g.Nautilus by g.tec ranks eighth, representing 1.71\\% of usage in \npublished research. \n \nThese findings demonstrate a global effort by researchers to conduct accessible studies using \nuser-friendly, low-cost, and widely available devices, revealing a significant gap between \nconsumer-grade and research-grade technologies. \n \nIn summary, most rehabilitation-oriented neuroscience studies will find an optimal balance in 16 to \n32-channel devices sampling at 1 kHz with 16-bit resolution, Bluetooth streaming, and a \nuser-friendly SDK. For laboratories with greater demands for spatial resolution or multimodal \nrecording, premium systems—though more expensive and operationally demanding—offer \nunparalleled data quality and flexibility. By understanding how hardware and software parameters \ninteract, researchers can select a brain monitoring system that best balances spatial coverage, signal \nfidelity, mobility, and cost to meet their specific investigative goals. \n \nLimitations of Technologies Evaluated \nThe technologies applied in brain research have been fundamental in enhancing our understanding of \nthe nervous system and in developing interventions for neurorehabilitation. However, their use \ncomes with several limitations that can impact their effectiveness, applicability, and reach across \ndifferent contexts. These limitations span technical, economic, and operational aspects, all of which \nmust be carefully considered in the development and implementation of these tools. \n \nFrom a technical perspective, key challenges include resolution, accuracy, and response time. EEG, for \nexample, offers excellent temporal resolution but lower spatial resolution compared to fNIRS. \nResponse time is particularly critical for real-time applications such as neurofeedback and BCI \ndevelopment. Reliability is another concern, as noise and external interference can compromise data \nquality and reduce the effectiveness of the methods. EEG measures electrical activity from the \ncerebral cortex, but signal distortions occur as electrical potentials pass through the skull and scalp. \nThese signals range from approximately -90 mV at rest to 40 mV at the peak of an action potential \nand require amplification, an essential step that can also introduce additional noise. \n \nNoise sources include improper electrode placement, oxidized or deteriorated electrodes, weak scalp \nattachment, poor contact due to dry or oily skin, hair strands, dirt, and crusts. Additional sources \ninclude movement artifacts from muscle activity, blinking, heartbeats, and electromagnetic \ninterference caused by electrical transients, radio frequencies, and grounding issues. Given these \nchallenges, EEG devices require meticulous electronic design, careful assembly, and circuits for \nattenuating oscillating electromagnetic frequencies. Connections and circuits must be shielded, \ncables should be short and shielded, and electrodes must be firmly and consistently attached to the \nscalp. Even with these precautions, significant computational effort is needed to filter the resulting \nsignals effectively.\n\nDue to the complex, non-stationary, and nonlinear characteristics of EEG signals, several systems \nhave been developed for data analysis. Signal complexity can be reduced using fast algorithms, \nenabling machine learning methods to automatically classify certain mental disorders with high \naccuracy. Disorders such as depression and epilepsy could be diagnosed at the same time. However, \nEEG-based diagnosis has limitations: patients may not exhibit abnormal patterns consistently, and \nshort EEG recordings can miss critical events, leading to inaccurate results. While long-term \nmonitoring improves the detection of abnormalities, EEG signals are highly susceptible to external \ninterference, and detecting periods of inactivity remains challenging [27]. \n \nUsability and ergonomics are key factors that influence the adoption of these technologies. Sensors \nand devices can be uncomfortable during extended acquisition sessions, while complex interfaces \nand advanced technical requirements may limit their use in clinical or home environments. The \nportability of certain devices, such as brain imaging systems (fMRI or PET), is also constrained by \ntheir size and dependence on specialized infrastructure, restricting their application to research \ncenters or hospitals. Additionally, the high cost of advanced technologies constitutes a barrier to \ntheir widespread implementation. \n \nThe fNIRS faces challenges in distinguishing brain hemodynamic changes from artifacts caused by \nscalp hemodynamics or movement. Photons detected by infrared receivers are influenced by \nphysiological factors like respiration and heart rate, reducing contrast and spatial resolution. The \ntechnique also suffers from low temporal resolution and SNR [28]. Efforts to improve signal quality \nrange from averaging multiple readings to using advanced statistical models, but low sensitivity to \ndeeper brain layers and the inherent statistical properties of the signal complicate data \ninterpretation [29]. \n \nSome technologies are unsuitable for patients with metal implants or cognitive impairments. \nCombining these tools with conventional therapeutic approaches can be complex, particularly when \ndetermining the clinical relevance of the data collected. Ethical and privacy concerns related to brain \nand physiological data collection further complicate their adoption, necessitating stringent \nregulations to ensure user trust and safety. \n \nThe EEG technology has advanced with the development of wireless systems, dry electrodes, and \nAI-driven data processing. Dry electrodes enhance usability by enabling faster and more accessible \nsetups. While fNIRS is less affected by electromagnetic interference, its sensitivity is limited by the \nslower hemodynamic response compared to the rapid transmission of electrical signals in EEG. \nAI-enhanced multimodal fNIRS systems are approaching clinical-grade performance, although high \ncosts remain a significant barrier. \n \nThe term research-grade quality is often used to describe devices suitable for scientific studies but \nnot meeting the stringent standards required for clinical use. In contrast, low-cost EEG modules, \npriced under fifty dollars, offer affordable alternatives. Commonly sold as do-it-yourself (DIY) kits, \nthese modules allow for customized assembly, making EEG technology more accessible. While they \nlack the advanced features and precision of clinical-grade systems, they still provide meaningful \ninsights into brain activity. \n \nSoftware is often sold separately, significantly increasing overall costs. Commercial solutions typically \nstart around \\$1,000, with advanced versions reaching up to \\$8,000. Temporary licenses, renewable \nsubscriptions, and lite versions with limited functionality are common, while open-source platforms\n\noffer more accessible alternatives. Some systems are specifically designed for neurofeedback, with \nsoftware tailored to training games. Increasingly, brain monitoring devices integrate artificial \nintelligence (AI) for real-time data processing, anomaly detection, and rapid diagnostics. Open access \nto raw or AI-processed data fosters innovation and supports new research applications. Free access \nto AI-filtered data is a valuable resource for the neuroscience community. \n \nSeveral brain equipment manufacturers offer either complete systems or modular components, \nallowing for user customization, though often without clear guidance for selection. Some companies, \ntraditionally focused on wired systems, have introduced wireless options, typically limited to \namplifiers without caps. Others operate exclusively through rental or contracted services, while \ncertain technologies remain under development. Identified manufacturers include Compumedics \nNeuroscan (AUS), fNIR Devices (USA), Hitachi (JPN), Neurosoft (RUS), BioSemi (NLD), iCelera (BRA), \nContec (CHN), Meditron (BRA), Neurovirtual (USA), TechEn (USA), Imec (BEL), Kernel (USA), \nMindfield (DEU), NeuroPro (CHE), Gowerlabs (ENG), Neurotec (BRA), and Deymed (CZE). \nAdditionally, low-cost module providers include Deuteron (ISR) and Sichiray (CHN). In some cases, \nwebsites are outdated or provide little evidence of ongoing product availability, raising concerns \nabout whether some manufacturers are still active. \n \nConclusion \nThis review provides a comprehensive and technically grounded synthesis of the current landscape of \nnoninvasive brain monitoring technologies, with emphasis on their applicability to neuroscience and \nneurorehabilitation. By systematically mapping the specifications, architectures, and operational \nfeatures of commercially available EEG and fNIRS systems, the study translates complex engineering \ndata into an actionable framework for device selection and experimental design. The proposed \nframework supports researchers and clinicians in aligning technical parameters with the specific \ngoals of their investigations, facilitating evidence-based, reproducible, and methodologically sound \nuse of neurotechnological tools. \n \nThe analysis highlights that device selection should be guided primarily by the intended research or \nclinical objective. High temporal resolution and signal fidelity are essential for applications such as \nevent-related potentials and functional connectivity analysis, whereas mobility, ease of deployment, \nand rapid setup are critical for field studies, BCI applications, and rehabilitation in movement-rich \ncontexts. Multimodal configurations, such as integrated EEG–fNIRS systems, further expand the \npotential for real-time monitoring, neurofeedback, and closed-loop virtual reality paradigms. Across \nmodalities, core decision parameters include electrode or optode type, channel density, sampling \nrate, bit resolution, wireless transmission protocol, and data accessibility through standardized \ninterfaces or SDKs. \n \nPractical trade-offs also emerge among systems. Wet and gel-based electrodes provide the highest \nsignal quality but require time-intensive preparation, while dry and semi-dry electrodes enhance \nusability and participant comfort at the cost of slightly increased impedance. Channel configurations \nbetween 8 and 32 are suitable for most BCI and connectivity studies, whereas high-density arrays \n($\\ge$ 64 channels) enable source localization and advanced spatial analysis. Sampling rates between \n250 and 500 Hz meet the majority of experimental demands, while higher rates (\\SI{\\ge \n1}{\\kilo\\hertz}) and 24-bit resolution are recommended for precision time-locked paradigms. Reliable \nwireless connectivity—preferably low-latency Wi-Fi for data-intensive applications and Bluetooth \nLow Energy for mobile protocols—supports robust multimodal synchronization and integration with \nimmersive environments.\n\nIn applied neurorehabilitation, integration with virtual reality systems requires ergonomically \noptimized, low-latency devices capable of sustaining high-quality signal acquisition during motion. \nSystems equipped with open SDKs and native synchronization libraries facilitate seamless \ncommunication with VR engines, enabling adaptive neurofeedback and ecological data capture. Dry \nelectrode designs are particularly advantageous in these contexts, improving participant comfort and \nreducing setup time while maintaining acceptable signal stability for most training and assessment \nscenarios. \n \nThe findings from the strong body of evidence in the scientific literature highlight a global movement \ntoward increasing the accessibility of neuroscience research through user-friendly, affordable, and \nwidely available devices, while also underscoring the persistent gap that remains between \nconsumer-grade and research-grade technologies. \n \nThe compiled dataset provides an evidence-based framework to guide neuroscientists, engineers, \nand clinicians in selecting the most appropriate device for their specific research needs. This work \nalso identifies critical technological trends, such as the strong convergence toward wireless \narchitectures and the growing emphasis on open data interfaces. \n \nOverall, this study contributes a reproducible, evidence-based technical mapping of EEG and fNIRS \ntechnologies, consolidating information from scientific, industrial, and patent sources into a unified \nclassification framework. Beyond informing device acquisition, these findings promote greater \ninteroperability, transparency, and standardization within the neurotechnology ecosystem. Future \nresearch should expand the evaluation scope to include longitudinal data quality, real-world \nreliability, and user experience metrics, strengthening the translational bridge between engineering \ninnovation and clinical neurorehabilitation. By doing so, the field moves closer to developing \nadaptive, accessible, and scientifically validated neurotechnological platforms capable of \ntransforming both neuroscience research and patient care. \n \nAcknowledgment \nThe authors acknowledge the support of CNPq and CAPES, whose continued commitment to \nscientific research, education, and innovation in Brazil made this work possible. \n \nBibliography \n1.​\nY. Duan, Z. Li, X. Tao, Q. Li, S. Hu, and J. Lu, “EEG-Based Maritime Object Detection for IoT-Driven Surveillance \nSystems in Smart Ocean,” IEEE Internet Things J., vol. 7, no. 10, pp. 9678–9687, Oct. 2020., doi:DOI: \n10.1109/JIOT.2020.2991025 \n2.​\nR. Zerafa, T. Camilleri, O. Falzon, and K. P. Camilleri, “A​ comparison of a broad range of EEG acquisition devices–is \nthere any difference for SSVEP BCIs” Brain Comput. Interfaces (Abingdon), vol. 5, no. 4, pp. 121–131, 2018., \ndoi:DOI: 10.1080/2326263X.2018.1550710 \n3.​\nK.-C. Chuang and Y.-P. Lin, “Cost-Efficient, Portable, and Custom Multi-Subject Electroencephalogram Recording \nSystem,” IEEE Access, vol. 7, pp. 56760–56769, 2019., doi:DOI: 10.1109/ACCESS.2019.2914088 \n4.​\nM. Doudou, A. Bouabdallah, and V. Berge-Cherfaoui, “Driver Drowsiness Measurement Technologies: Current \nResearch, Market Solutions, and Challenges,” International Journal of Intelligent Transportation Systems \nResearch, vol. 18, no. 2, pp. 297–319, 2020., doi:DOI: 10.1007/s13177-019-00199-w \n5.​\nG. Niso, E. Romero, J. T. Moreau, A. Araujo, and L. R. Krol, “Wireless EEG: A survey of systems and studies,” \nNeuroimage, vol. 269, p. 119774, Apr. 1 2023., doi:DOI: 10.1016/j.neuroimage.2022.119774\n\n6.​\nG. Aggarwal, X. Dai, R. Saatchi, R. Binns, and A. Sikandar, “Experimental demonstration of single-channel EEG \nsignal using 32 × 32 pixel OLED screen and camera,” Electronics (Basel), vol. 8, no. 7, p. 734, 2019., doi:DOI: \n10.3390/electronics8070734 \n7.​\nH. W. Huang, J. T. King, and C. L. Lee, “The New Science of Learning: Using the Power and Potential of the Brain to \nInform Digital Learning,” J. Educ. Technol. Soc., vol. 23, no. 4, pp. 1–13, 2020. \n8.​\nA. Grasso-Cladera, S. Costa-Cordella, A. Rossi, N. F. Fuchs, and F. J. Parada, “Mobile Brain/Body Imaging: \nChallenges and opportunities for the implementation of research programs based on the 4E perspective to \ncognition,” Adapt. Behav., vol. 31, no. 5, pp. 423–448, 2023., doi:DOI: 10.1177/10597123211072613 \n9.​\nC. He, Y. Y. Chen, C. R. Phang, C. Stevenson, I. P. Chen, T. P. Jung, et al., “Diversity and Suitability of the \nState-of-the-Art Wearable and Wireless EEG Systems Review,” IEEE J. Biomed. Health Inform., vol. 27, no. 8, pp. \n3830–3843, Aug. 2023., doi:DOI: 10.1109/JBHI.2023.3239053 \n10.​ E. Loizaga, A. T. Eyam, L. Bastida, and J. L. M. Lastra, “A Comprehensive Study of Human Factors, Sensory \nPrinciples, and Commercial Solutions for Future Human-Centered Working Operations in Industry 5.0,” IEEE \nAccess, vol. 11, pp. 53806–53829, 2023., doi:DOI: 10.1109/ACCESS.2023.3280071 \n11.​ J. Hernández-Capistrán, G. Alor-Hernández, H. Marín-Vega, M. Bustos-López, L. N. Sanchez-Morales, and J. L. \nSanchez-Cervantes, “Commercial Wearables for the Management of People with Autism Spectrum Disorder: A \nReview,” Biosensors (Basel), vol. 14, no. 11, p. 556, Nov. 15 2024., doi:DOI: 10.3390/bios14110556 \n12.​ D. Antolínez, A. Cisnal, V. Martínez-Cagigal, E. Santamaría-Vázquez, D. Benavides, J. Granja, et al., “Development \nand Validation of an Affordable Wearable Multichannel EEG System With Active Electrodes and Innovative \nFlexible Headbands,” IEEE Access, vol. 13, pp. 83983–83995, 2025., doi:DOI: 10.1109/ACCESS.2025.3568302 \n13.​ F. Minow, “Minimizing impedances and using the right electrolyte gel saves time and makes research more \neffective: a guidance from Falk Minow”, Brain Prod. Press Release, vol. 48, Oct. 2013, Access: May 2025. [Online]. \nhttps://www.easycap.de/wp-content/uploads/2018/02/ImpedancesElectrolytes.pdf \n14.​ H. Hinrichs, M. Scholz, A. K. Baum, J. W. Y. Kam, R. T. Knight, and H.-J. Heinze, “Comparison between a wireless dry \nelectrode EEG system with a conventional wired wet electrode EEG system for clinical applications,” Sci. Rep., vol. \n10, no. 1, p. 5218, Mar. 23 2020., doi:DOI: 10.1038/s41598-020-62154-0 \n15.​ D. Liley and L. Kuhlmann, “Comparison of waveguard touch dry electrodes to conventional gelled electrodes on \nphysiological \nparadigms”. \nAccess: \nMay \n2025. \n[Online]. \nhttps://www.ant-neuro.com/blog/showcases-1/comparison-of-waveguard-touch-dry-electrodes-to-conventional-\ngelled-electrodes-on-physiological-paradigms-62\\#blog\\_content. \n16.​ V. Nathan and R. Jafari, “Design Principles and Dynamic Front End Reconfiguration for Low Noise EEG Acquisition \nWith Finger Based Dry Electrodes,” IEEE Trans. Biomed. Circuits Syst., vol. 9, no. 5, pp. 631–640, Oct. 2015., \ndoi:DOI: 10.1109/TBCAS.2015.2471080 \n17.​ I. F. Warsito, M. Komosar, M. A. Bernhard, P. Fiedler, and J. Haueisen, “Flower electrodes for comfortable dry \nelectroencephalography,” Sci. Rep., vol. 13, no. 1, p. 16589, Oct. 3 2023., doi:DOI: 10.1038/s41598-023-42732-8 \n18.​ P. Tallgren, S. Vanhatalo, K. Kaila, and J. Voipio, “Evaluation of commercially available electrodes and gels for \nrecording of slow EEG potentials,” Clin. Neurophysiol., vol. 116, no. 4, pp. 799–806, Apr. 2005., doi:DOI: \n10.1016/j.clinph.2004.10.001 \n19.​ I. Rakhmatulin, “Low-Cost Shield ardEEG to Measure EEG with Arduino Uno R4 WiFi”, May 2024. DOI: \n10.20944/preprints202405.1643.v1. \n20.​ D. S. Kumar, et al., “A high CMRR analog front-end IC for wearable physiological monitoring”, in 2012 Annual IEEE \nIndia Conference (INDICON), Kochi: IEEE, Dec 2012, p. 385–388. DOI: 10.1109/INDCON.2012.6420648. \n21.​ S. Iwama, M. Takemi, R. Eguchi, R. Hirose, M. Morishige, and J. Ushiba, “Two common issues in synchronized \nmultimodal recordings with EEG: Jitter and latency,” Neurosci. Res., vol. 203, pp. 1–7, Jun. 2024., doi:DOI: \n10.1016/j.neures.2023.12.003 \n22.​ M. Serra-Sala, C. Timoneda-Gallart, and F. Pérez-Álvarez, “Clinical usefulness of hemoencephalography beyond the \nneurofeedback,” Neuropsychiatr. Dis. Treat., vol. 12, May, pp. 1173–1180, May 11 2016., doi:DOI: \n10.2147/NDT.S105476 \n23.​ A. A. Bisu, A. Purvis, K. Brigham, and H. Sun, “A Framework for End-to-End Latency Measurements in a Satellite \nNetwork Environment”, em 2018 IEEE International Conference on Communications (ICC), Kansas City, MO: IEEE, \nMay 2018, p. 1–6. DOI: 10.1109/ICC.2018.8422913.\n\n24.​ F. Klassen and R. Silverman, “System and method for analyzing and tuning a communications network”, \nUS6711137B1, 1999 Access: Jun 2025. [Online] https://patents.google.com/patent/US6711137B1/en \n25.​ B. Sawant, “Latency and Throughput Optimization In Modern Networks,” Int. J. Adv. Res. Sci. Commun. Technol., \nMay, pp. 585–592, 2021., doi:DOI: 10.48175/IJARSCT-1298 \n26.​ J.-P. Stauffert, F. Niebling, and M. E. Latoschik, “Reducing application-stage latencies for real-time interactive \nsystems”, in 2016 IEEE 9th Workshop on Software Engineering and Architectures for Realtime Interactive \nSystems (SEARIS), Greenville, SC, USA: IEEE, Mar 2016, p. 1–7. DOI: 10.1109/SEARIS.2016.7551584. \n27.​ Y. Zheng, C. Liu, N. Y. G. Lai, Q. Wang, Q. Xia, X. Sun, et al., “Current development of biosensing technologies \ntowards diagnosis of mental diseases,” Front. Bioeng. Biotechnol., vol. 11, p. 1190211, Jun. 29 2023., doi:DOI: \n10.3389/fbioe.2023.1190211 \n28.​ R. Li, D. Yang, F. Fang, K.-S. Hong, A. L. Reiss, and Y. Zhang, “Concurrent fNIRS and EEG for Brain Function \nInvestigation: A Systematic, Methodology-Focused Review,” Sensors (Basel), vol. 22, no. 15, p. 5865, Aug. 5 2022., \ndoi:DOI: 10.3390/s22155865 \n29.​ C. T. Baker, “Documenting the Effects of Noninvasive Prefrontal pIR HEG Neurofeedback in the Treatment of \nCommon Mental Health Problems”, NeuroRegulation, vol. 10, no 3, p. 207–218, Set 2023, DOI: \n10.15540/nr.10.3.207. \n30.​ K.-C. Chuang and Y.-P. Lin, “Cost-Efficient, Portable, and Custom Multi-Subject Electroencephalogram Recording \nSystem,” IEEE Access, vol. 7, pp. 56760–56769, 2019, doi: 10.1109/ACCESS.2019.2914088. \n31.​ M. Doudou, A. Bouabdallah, and V. Berge-Cherfaoui, “Driver Drowsiness Measurement Technologies: Current \nResearch, Market Solutions, and Challenges,” International Journal of Intelligent Transportation Systems \nResearch, vol. 18, no. 2, pp. 297–319, 2020, doi: 10.1007/s13177-019-00199-w.",
  "total_caracteres": 57618
}